--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年10月16日15时26分2秒
--=============================================================================--

New窗口模板  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function New窗口模板:初始化(x坐标,y坐标)
	
	self.标识 = "技能窗口"
	self.面板图片 = 引擎:载入图片("Dat/UI/技能窗口.png")
	self.面板精灵 = D2D_精灵.创建(self.面板图片,0,0,引擎:取图片宽度(self.面板图片),引擎:取图片高度(self.面板图片))
	
	
	self.触发移动包围盒 = D2D_包围盒.创建(x坐标,y坐标,275,40)
	self.关闭按钮 = 类_三层序列图按钮.创建("Dat/ui/面板关闭按钮.png", x坐标 + 245,y坐标+11,false)
	
	
	
	self.可视 = false
	self.移动  = true
	self.可移动 = true
	self.事件激活 = false
	self.坐标 = {x=x坐标,y=y坐标}
	self.焦点 = false
	self.临时点= { x=0 , y=0 }
	self.最后激活时间 = 0
	



	
	
	
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function New窗口模板:更新()

	if(self.可视 ) then
	
		if (Q_屏幕.鼠标窗口全id ~= 0 and Q_屏幕.界面_窗口_数组[Q_屏幕.鼠标窗口全id].标识 == self.标识 ) then
			self.焦点 = true
		else 
			self.焦点 = false 
		end
		
		
		self.关闭按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
		
		if ( self.焦点) then 
			if(self.关闭按钮:取是否单击())then
				self:开关()
			end
		end 
		
		

--		

		
		
	end 
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function New窗口模板:显示()


	if(self.可视 ) then
		
		self.面板精灵:显示(self.坐标.x,self.坐标.y)
			
			
		self.关闭按钮:显示()
		
		if (Q_调试) then 
			self.触发移动包围盒:显示()
		end 
		
	end 
	
	
	


end





--=============================================================================--
-- ■ 开始移动()
--=============================================================================--

function New窗口模板:开始移动()

	if (self.可视 and self.焦点 and self.可移动) then
		self.坐标.x =  Q_游戏数据.鼠标坐标.x - self.临时点.x
		self.坐标.y =  Q_游戏数据.鼠标坐标.y - self.临时点.y
		self.触发移动包围盒:置位置(self.坐标.x,self.坐标.y)
		self.关闭按钮:置位置( self.坐标.x + 245,self.坐标.y+11)
		
	end


end




--=============================================================================--
-- ■ 置焦点()
--=============================================================================--

function New窗口模板:置焦点(是否焦点)
	self.焦点 = 是否焦点
end



--=============================================================================--
-- ■ 移动()
--=============================================================================--

function New窗口模板:初始移动()

	self.最后激活时间 = 引擎:取运行时间()

	if (self.事件激活 == false ) then
		Q_屏幕.移动焦点窗口 = true
	end


	if (self.可视 and self.焦点 and self.可移动) then
		self.临时点.x = Q_游戏数据.鼠标坐标.x - self.坐标.x
		self.临时点.y = Q_游戏数据.鼠标坐标.y - self.坐标.y
	end

end








--=============================================================================--
-- ■ 打开()
--=============================================================================--

function New窗口模板:打开(x,y)
	self.可视 = true
	self.最后激活时间 = 引擎:取运行时间()
	self.焦点 = true
	
	self.坐标.x = x
	self.坐标.y = y

	self.触发移动包围盒:置位置(self.坐标.x,self.坐标.y)
	self.关闭按钮:置位置( self.坐标.x + 245,self.坐标.y+11)




end

--=============================================================================--
-- ■ 开关()
--=============================================================================--

function New窗口模板:开关()


	
	if(self.可视) then
		self.可视 = false
		self.焦点 = false 
		Q_游戏数据.音效组.窗口关闭:播放()
	else
		self.可视 = true
		self.最后激活时间 = 引擎:取运行时间()
		self.焦点 = true
		Q_游戏数据.音效组.窗口打开:播放()
	end

	
	
end




--=============================================================================--
-- ■ 检测点()
--=============================================================================--

function New窗口模板:检测点()

	if (self.事件激活) then
		self.可移动 = false
	else
		self.可移动 = true
	end

	
	if (self.可视  and self.关闭按钮:是否有焦点() == false ) then
		if (self.触发移动包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)) then 
			return true
		end 
	end

	return false

end


--=============================================================================--
-- ■ 检测点_全局()
--=============================================================================--

function New窗口模板:检测点_全局()
		
	if (self.面板精灵:取包围盒():检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y) or 
	     self.触发移动包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	     
		) then 
		return  true 
	end 
	
	return false
		
end 








