--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年10月16日15时26分2秒
--=============================================================================--

类_窗口_角色状态  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_窗口_角色状态:初始化(x坐标,y坐标)
	
	self.标识 = "状态窗口"
	self.面板图片 = 引擎:载入图片("Dat/UI/角色属性.png")
	local 宽度 = 引擎:取图片宽度(self.面板图片)
	local 高度 = 引擎:取图片高度(self.面板图片)
	
	self.面板精灵 = D2D_精灵.创建(self.面板图片,0,0,宽度,高度)
	
	self.面板渲染区 = 引擎:创建渲染区(宽度,高度,true)
	self.面板渲染区精灵 = D2D_精灵.创建(引擎:取渲染区纹理(self.面板渲染区),0,0,宽度,高度)
	self.面板渲染结束 = true
	
	
	
	
	
	self.触发移动包围盒 = D2D_包围盒.创建(x坐标,y坐标,290,40)
	self.关闭按钮 = 类_三层序列图按钮.创建("Dat/ui/面板关闭按钮.png", x坐标 + 261,y坐标+11,false)
	
	
	
	self.可视 = false
	self.移动  = true
	self.可移动 = true
	self.事件激活 = false
	self.坐标 = {x=x坐标,y=y坐标}
	self.焦点 = false
	self.临时点= { x=0 , y=0 }
	self.最后激活时间 = 0
	
	
	self.格斗家头像图片 = 引擎:载入图片("Dat/ui/格斗家属性窗口头像.png")
	self.格斗家头像精灵 = D2D_精灵.创建(self.格斗家头像图片,0,0,59,81)
	


	
	
	
end




--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_窗口_角色状态:更新()

	if (not self.面板渲染结束) then
		
		
		渲染开始(self.面板渲染区)
		清屏()
		
		文字:显示_描边(127+math.ceil((145 - 文字:取宽度(Q_主角.属性.名称))/2),48,Q_主角.属性.名称,颜色_白,-15724528)
		文字:显示_描边(127+math.ceil((145 - 文字:取宽度(Q_主角.职业))/2),68,Q_主角.职业,颜色_白,-15724528)
		
		local 等级经验信息 = string.format("Lv.%d (%d/%d)",Q_主角.属性.等级,Q_主角.属性.经验值,取升级所需经验(Q_主角.属性.等级))
		文字:显示_描边(127+math.ceil((145 - 文字:取宽度(等级经验信息))/2),90,等级经验信息,颜色_白,-15724528)
		
		local hp信息 = string.format("%d/%d",Q_主角.属性.hp,Q_主角.属性.maxhp)
		文字:显示_描边(82+math.ceil((57 - 文字:取宽度(hp信息))/2),148,hp信息,颜色_白,-15724528)
		
		local mp信息 = string.format("%d/%d",Q_主角.属性.mp,Q_主角.属性.maxmp)
		文字:显示_描边(210+math.ceil((63 - 文字:取宽度(mp信息))/2),148,mp信息,颜色_白,-15724528)
		
		
		文字:显示_描边(82+math.ceil((57 - 文字:取宽度(Q_主角.属性.力量))/2),175,Q_主角.属性.力量,颜色_白,-15724528)
		文字:显示_描边(210+math.ceil((63 - 文字:取宽度(Q_主角.属性.体力))/2),175,Q_主角.属性.体力,颜色_白,-15724528)
		
		文字:显示_描边(82+math.ceil((57 - 文字:取宽度(Q_主角.属性.智力))/2),202,Q_主角.属性.智力,颜色_白,-15724528)
		文字:显示_描边(210+math.ceil((63 - 文字:取宽度(Q_主角.属性.精神))/2),202,Q_主角.属性.精神,颜色_白,-15724528)
		
		
		文字:显示_描边(86+math.ceil((56 - 文字:取宽度(Q_主角.属性.物理攻击))/2),236,Q_主角.属性.物理攻击,颜色_白,-15724528)
		文字:显示_描边(218+math.ceil((56 - 文字:取宽度(Q_主角.属性.物理防御))/2),236,Q_主角.属性.物理防御,颜色_白,-15724528)
		
		
		文字:显示_描边(86+math.ceil((56 - 文字:取宽度(Q_主角.属性.魔法攻击))/2),262,Q_主角.属性.魔法攻击,颜色_白,-15724528)
		文字:显示_描边(218+math.ceil((56 - 文字:取宽度(Q_主角.属性.魔法防御))/2),262,Q_主角.属性.魔法防御,颜色_白,-15724528)
		
		
		
		
		
		
		渲染结束()
		
		self.面板渲染结束 = true
		
	end
	
	

	if(self.可视 ) then
	
		if (Q_屏幕.鼠标窗口全id ~= 0 and Q_屏幕.界面_窗口_数组[Q_屏幕.鼠标窗口全id].标识 == "状态窗口" ) then
			self.焦点 = true
		else 
			self.焦点 = false 
		end
		
		self.关闭按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
		
		if ( self.焦点) then 
			if(self.关闭按钮:取是否单击())then
				self:开关()
			end
		end 
		
	end 
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_窗口_角色状态:显示()


	if(self.可视 ) then
		
		self.面板精灵:显示(self.坐标.x,self.坐标.y)
		self.面板渲染区精灵:显示(self.坐标.x,self.坐标.y)
		
		
		self.格斗家头像精灵:显示(self.坐标.x + 19,self.坐标.y+44)
		
		
		self.关闭按钮:显示()
		
		if (Q_调试) then 
			self.触发移动包围盒:显示()
		end 
		
	end 
	
	
	


end





--=============================================================================--
-- ■ 开始移动()
--=============================================================================--

function 类_窗口_角色状态:开始移动()

	if (self.可视 and self.焦点 and self.可移动) then
		self.坐标.x =  Q_游戏数据.鼠标坐标.x - self.临时点.x
		self.坐标.y =  Q_游戏数据.鼠标坐标.y - self.临时点.y
		self.触发移动包围盒:置位置(self.坐标.x,self.坐标.y)
		self.关闭按钮:置位置( self.坐标.x + 261,self.坐标.y+11)
		
	end


end




--=============================================================================--
-- ■ 置焦点()
--=============================================================================--

function 类_窗口_角色状态:置焦点(是否焦点)
	self.焦点 = 是否焦点
end



--=============================================================================--
-- ■ 移动()
--=============================================================================--

function 类_窗口_角色状态:初始移动()

	self.最后激活时间 = 引擎:取运行时间()

	if (self.事件激活 == false ) then
		Q_屏幕.移动焦点窗口 = true
	end


	if (self.可视 and self.焦点 and self.可移动) then
		self.临时点.x = Q_游戏数据.鼠标坐标.x - self.坐标.x
		self.临时点.y = Q_游戏数据.鼠标坐标.y - self.坐标.y
	end

end








--=============================================================================--
-- ■ 打开()
--=============================================================================--

function 类_窗口_角色状态:打开(x,y)
	self.可视 = true
	self.最后激活时间 = 引擎:取运行时间()
	self.焦点 = true
	
	self.坐标.x = x
	self.坐标.y = y

	self.触发移动包围盒:置位置(self.坐标.x,self.坐标.y)
	self.面板渲染结束 = false




end

--=============================================================================--
-- ■ 开关()
--=============================================================================--

function 类_窗口_角色状态:开关()

	
	if(self.可视) then
		self.可视 = false
		self.焦点 = false 
		Q_游戏数据.音效组.窗口关闭:播放()
	else
		self.面板渲染结束 = false
		self.可视 = true
		self.最后激活时间 = 引擎:取运行时间()
		self.焦点 = true
		Q_游戏数据.音效组.窗口打开:播放()
	end

	
	
end




--=============================================================================--
-- ■ 检测点()
--=============================================================================--

function 类_窗口_角色状态:检测点()

	if (self.事件激活) then
		self.可移动 = false
	else
		self.可移动 = true
	end

	
	if (self.可视 and self.关闭按钮:是否有焦点() == false ) then
		if (self.触发移动包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)) then 
			return true
		end 
	end

	return false

end


--=============================================================================--
-- ■ 检测点_全局()
--=============================================================================--

function 类_窗口_角色状态:检测点_全局()
		
	if (self.面板精灵:取包围盒():检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y) or 
	     self.触发移动包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	     
		) then 
		return  true 
	end 
	
	return false
		
end 








