--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年4月25日9时37分6秒
--=============================================================================--

类_地图物品类  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_地图物品类:初始化(物品,坐标x,坐标y,数量,随机属性,附加倍数)
		
	self.标识类型 = "地面掉落物"
	
	self.附加倍数 = 附加倍数
	self.随机属性 = 随机属性


	self.坐标 = {x = 坐标x,
				y = 坐标y }
	
	self.物品落点 = {x=self.坐标.x , y =self.坐标.y}
	
	self.排序参照点 = 坐标y 
	
	self.渐变变量 = 0
	self.物品 = 物品
	self.数量 = 数量
	self.激活 = false
	self.已经消失 = false
	
	self. 物理信息= {x方向速度 = 引擎:取随机小数 (-0.5, 0.5),
						y方向速度 = 引擎:取随机小数 (-7, -10),
						重力加速度 = 引擎:取随机小数 (0.3, 0.5),
						旋转值 = 引擎:取随机小数 (-0.3, 0.3),
						力度 = 引擎:取随机小数 (0.5, 1),
						旋转度 = 0,
						当前位置= {x= self.坐标.x,
								    y= self.坐标.y }
						}
						
	self.方向 = 引擎:取随机整数(-1,1)
	
	
	local 道具图片 = nil
	
	if (物品.名称 == "金币") then
		
		if (self.数量 < 100) then
			道具图片 = 取图片缓存纹理("Dat/itemico/地面/26.png" )
		else
			道具图片 = 取图片缓存纹理("Dat/itemico/地面/27.png" )
		end
		
	else
		道具图片 = 取图片缓存纹理("Dat/itemico/地面/" .. 物品.地面图标)
	end
	
	
	
	self.掉落精灵 = D2D_精灵.创建(道具图片 ,0,0,引擎:取图片宽度(道具图片),引擎:取图片高度(道具图片))
	self.掉落精灵:置中心点(取整_(引擎:取图片宽度(道具图片)/2),取整_( 引擎:取图片高度(道具图片)/2))
	
	
	
	
	
	if (self.物品.总类 == "金币") then 
		self.显示内容 = string.format("金币(%d)",self.数量)
		
	else 
		if (self.数量 > 1) then 
			self.显示内容 = string.format("%s(%d)",self.物品.名称,self.数量)
		else 
			if (self.物品.总类 == "装备" and  self.物品.品级 > 0) then 
				self.显示内容 = string.format("%s+%d",self.物品.名称,self.物品.品级 )
			else 
				self.显示内容 = string.format("%s",self.物品.名称)
			end 
		end 
		
	end 

	
	self.物品说明标签 =   类_GUI_标签.创建(文字:取宽度(self.显示内容)+16,28,ARGB(200,0,0,0))
	
	if ( self.物品.颜色值 == "IL" ) then  -- 蓝色
		self.物品说明标签:置标题(self.显示内容,2,-9906707,-15724528) 
	elseif ( self.物品.颜色值 == "IZ" ) then  
		self.物品说明标签:置标题(self.显示内容,2,颜色_紫,-15724528) 
	elseif ( self.物品.颜色值 == "IC" ) then   
		self.物品说明标签:置标题(self.显示内容,2,颜色_橙,-15724528) 
	elseif ( self.物品.颜色值 == "黄" ) then   
		self.物品说明标签:置标题(self.显示内容,2,颜色_黄,-15724528) 
	elseif ( self.物品.颜色值 == "IF" ) then   
		self.物品说明标签:置标题(self.显示内容,2,-256364,-15724528) 
	else
		self.物品说明标签:置标题(self.显示内容,2,颜色_白,-15724528) 
	end 

	
	
	Q_游戏数据.音效组.物品掉落音效:播放()
	
	
	


end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_地图物品类:更新()

-- 可优化	
	
	
	
	self.物品说明标签:更新()
	
	
	
	
	if ( self.掉落精灵:取包围盒():检测_点(Q_主角.地图坐标.x,Q_主角.地图坐标.y)) then
		self.激活 = true
		Q_主角.拥有捡取物品 = self
		
		
		
	else 
		self.激活 = false
	end
	
	
	
	
	
	
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_地图物品类:显示()


	if (self.物理信息.y方向速度 >= 0) then
		
		self.物理信息.y方向速度 = self.物理信息.y方向速度 + self.物理信息.重力加速度
		self.物理信息.当前位置.y = self.物理信息.当前位置.y + self.物理信息.y方向速度

		if (self.物理信息.当前位置.y >= self.物品落点.y) then
			self.物理信息.当前位置.y = self.物品落点.y
			
			if (self.物理信息.x方向速度 ~= 0) then
				self.物理信息.y方向速度 = 0
				self.物理信息.x方向速度 = 0
				self.物理信息.重力加速度 = 0
				self.物理信息.旋转度 = 0
				self.缩放变量 = 0.5
				
				播放道具音效(self.物品)
				
				
				
			end
			
		else
			self.物理信息.旋转度 = self.物理信息.旋转度 + self.物理信息.旋转值
		end
		
	
	else
		self.物理信息.y方向速度 = self.物理信息.y方向速度 + self.物理信息.重力加速度

		if (self.物理信息.y方向速度 >= 0) then
			self.物理信息.y方向速度 = 0

		else
			self.物理信息.当前位置.y = self.物理信息.当前位置.y + self.物理信息.y方向速度
			self.物理信息.旋转度 = self.物理信息.旋转度 + self.物理信息.旋转值
		end
		

	end
	
	if ( self.物理信息.力度 > 0) then 
		self.物理信息.力度 = self.物理信息.力度 + dt
		
		if ( self.物理信息.x方向速度  == 0) then 
			self.物理信息.力度 = 0
		end 
	end 
	
	if (self.方向 > 0)then 
		self.物理信息.当前位置.x = self.物理信息.当前位置.x + self.物理信息.x方向速度 + self.物理信息.力度	
	else 
		self.物理信息.当前位置.x = self.物理信息.当前位置.x + self.物理信息.x方向速度 - self.物理信息.力度
		
	end 
	
	
	
	
	if (self.激活 and self.物理信息.y方向速度 == 0) then
		self.掉落精灵:置混合模式(混合_单色)
		self.掉落精灵:置颜色(颜色_黄)
		self.掉落精灵:显示(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x +1 ,self.物理信息.当前位置.y)
		self.掉落精灵:显示(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x -1  ,self.物理信息.当前位置.y)
		self.掉落精灵:显示(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x ,self.物理信息.当前位置.y +1 )
		self.掉落精灵:显示(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x ,self.物理信息.当前位置.y-1)
		
		
		
		
		self.掉落精灵:置混合模式(混合_默认)
		self.掉落精灵:置颜色(颜色_白)
		
	--self.物品说明标签.标签渲染精灵:置混合模式(混合_单色)
		--self.物品说明标签.标签渲染精灵:置颜色(颜色_黄)
		
		self.物品说明标签.标签渲染精灵:显示(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x ,self.物理信息.当前位置.y -40)
	
		
		
		self.物品说明标签.标签渲染精灵:置混合模式(混合_默认)
		self.物品说明标签.标签渲染精灵:置颜色(颜色_白)
		
	end
	
	
	
	--self.掉落精灵:置颜色(颜色_白)
	self.掉落精灵:显示_高级(self.物理信息.当前位置.x + Q_游戏数据.画面偏移.x ,self.物理信息.当前位置.y, self.物理信息.旋转度,1,1)
	
	
	
	self.物品说明标签:显示(self.物理信息.当前位置.x+ Q_游戏数据.画面偏移.x,self.物理信息.当前位置.y -40)
	
	
	
	
	
	if (Q_调试) then
		self.掉落精灵:取包围盒():显示()
	end
	
	
	

end


--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 类_地图物品类:销毁()


end


