--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年9月11日13时44分25秒
--=============================================================================--

格子_包裹格子  = class()





--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 格子_包裹格子:初始化(x坐标, y坐标, 宽, 高,标识,类别)

      self.标识 = 标识
	self.类别 = 类别
      self.x =  x坐标
      self.y =  y坐标
      self.包围盒  = D2D_包围盒.创建(x坐标, y坐标, 宽, 高)
      self.极品项目 = 0
      self.道具信息 = ""
      self.道具 = {id=0,位置=标识,数量=0}
	self.首次按下 = 0
	self.焦点 = false 
	self.偏移Y = 0
	self.鼠标焦点位置 = {x=0,y=0}
	self.道具标识 = 0
	
	
	self.风格提示= {
			原始内容 = "" ,
			风格文字组 = {},
			宽度 = 0,
			高度 = 0
	}
	
	
	self.特殊标识风格提示= {
			原始内容 = "" ,
			风格文字组 = {},
			宽度 = 0,
			高度 = 0
	}

	if (self.标识 > 500 and self.标识 < 510) then 
		self.特殊标识风格提示.原始内容 = self.类别
		self.特殊标识风格提示.风格文字组, self.特殊标识风格提示.宽度 , self.特殊标识风格提示.高度 = 格式化文字 (文字,string.format("%s",self.特殊标识风格提示.原始内容),5) 
	end 
	
	
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 格子_包裹格子:更新()

	
	if ( self.包围盒:检测_点(Q_游戏数据.鼠标坐标.x, Q_游戏数据.鼠标坐标.y) and Q_屏幕.信息框.焦点 == false) then
	
		if (self.焦点 == false ) then -- 焦点 格式化道具属性
			
			if (self.道具标识 ~= 0) then 
				self:更新道具属性()
			end 
			
			self.焦点 = true 
		end 	
		
		
		if (Q_游戏数据.鼠标道具.id  == 0 and 引擎:取按键按下 (键_鼠标右)) then	 -- 鼠标右键单击格子
			if (self.标识 >2000 and self.标识 <= 2005) then 
			else
				self:鼠标右键单击逻辑()
			end
		end
		
		
		if (引擎:取按键按下 (键_鼠标左) ) then	
			
--			if (Q_游戏数据.鼠标道具.id  ~= 0) then 
--				return
--			end 
			if (Q_游戏数据.鼠标道具.id  == 0) then		--鼠标按下 鼠标无物品 格子本身有物品   ->拿起道具
				
				if ( self:是商店格子() ) then -- 商店格子鼠标处理
					
					Q_游戏数据.鼠标道具.id  = self.道具标识
					Q_游戏数据.鼠标道具.道具 = self.道具
					Q_游戏数据.最后点击格子  = self
	
				
				else 
					if ( self:能否拿起()) then --包裹其他格子处理
						
						if (引擎:取按键事件(键_SHIFT) and  self.道具.数量 > 1 and (self.道具.总类 == "材料" or self.道具.总类 == "消耗")  ) then  -- 拆分
							--调试输出(取实际(self.道具.数量))
							Q_游戏数据.最后点击格子  = self
							Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,self.道具,"拆分_数量输入")
							
						else
						
							Q_游戏数据.鼠标道具.id  = self.道具标识
							Q_游戏数据.鼠标道具.道具 = self.道具
							self.道具标识 = 0
							Q_游戏数据.最后点击格子  = self
							
							Q_主角:更新纸娃娃(self.类别,"默认",self.道具.子类)
						end
					end 
				end 
			else
			
				if ( self:是商店格子() ) then -- 商店格子鼠标处理
					

					if (Q_游戏数据.最后点击格子.标识 >= 1 and Q_游戏数据.最后点击格子.标识<=240) then   --是包裹内的物品格子
						

						if (Q_游戏数据.鼠标道具.道具.数量 == 1) then  -- 单个物品 直接销售
							Q_系统:增加金币(Q_游戏数据.鼠标道具.道具.价格/2 )
							Q_游戏数据.鼠标道具.id = 0
							--金币_音效:播放()
						else 
							
							Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"","数量输入","出售",Q_游戏数据.鼠标道具.道具)
							Q_游戏数据.鼠标道具.id = 0
							
						end 

						
						
					elseif (Q_游戏数据.最后点击格子.标识 > 1000 and Q_游戏数据.最后点击格子.标识<=1500 ) then 
						
						
						if (self.道具标识 == 0 ) then       --鼠标按下 且鼠标有物品 包裹位置没有物品    ->在该位置放下物品
							
							Q_游戏数据.鼠标道具.id = 0
							
						else					        --' 鼠标按下 且鼠标和包裹该位置都有物品     ->交换道具
							Q_游戏数据.鼠标道具.id  = self.道具标识
							Q_游戏数据.鼠标道具.道具 = self.道具
							Q_游戏数据.最后点击格子  = self
							
						end
					
					end 
					
					
				else  
				
					if ( self:检测是否可放() ) then 
						
						if (self.道具标识 == 0 ) then       --鼠标按下 且鼠标有物品 包裹位置没有物品    ->在该位置放下物品
							
							self:置道具(Q_游戏数据.鼠标道具.道具,Q_游戏数据.鼠标道具.道具.数量,true)
							Q_游戏数据.鼠标道具.id = 0
							--Q_屏幕:更新负重()
							
	
						else					        --' 鼠标按下 且鼠标和包裹该位置都有物品     ->交换道具
						
							if (Q_游戏数据.鼠标道具.id == self.道具标识 and Q_游戏数据.鼠标道具.道具.可叠加  and self.道具.可叠加 ) then  -- 如果不是装备类道具 可以叠加 这里叠加下重复的道具 最大叠加数量设置为100
								local 剩余数量 = 0
								剩余数量 = Q_游戏数据.鼠标道具.道具.数量 + self.道具.数量 - 100
								
								
								if (剩余数量<=0) then 
									self.道具.数量  = self.道具.数量 +  Q_游戏数据.鼠标道具.道具.数量
									Q_游戏数据.鼠标道具.id = 0
								else
									self.道具.数量 = 100
									Q_游戏数据.鼠标道具.道具.数量 = 剩余数量
								end 
							else
								
									
									
									self.道具,Q_游戏数据.鼠标道具.道具 =  Q_游戏数据.鼠标道具.道具 ,self.道具
									Q_游戏数据.鼠标道具.id = Q_游戏数据.鼠标道具.道具.id  
									
									self:置道具(self.道具,self.道具.数量,true)
									
							
								--Q_屏幕:更新负重()
							end 
							
							
							
						end
						
					end 	
				end 
				
			end 
			
--			self:英雄装备属性更新判断()

		end 
	else 
		self.焦点 = false  
	end 
	


	if(self.道具标识 == 0) then

		if ( self.标识 > 500 and self.标识 < 510) then 
			if ( self.包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y) ) then
				Q_屏幕.最顶气泡显示 = true
				Q_屏幕.风格提示.风格文字组 = self.特殊标识风格提示.风格文字组
				Q_屏幕.风格提示.宽度 = self.特殊标识风格提示.宽度
				Q_屏幕.风格提示.高度 = self.特殊标识风格提示.高度
				
				if (self.x < 100) then 
					Q_屏幕.风格提示.x = self.x  + 27
				else 
					Q_屏幕.风格提示.x = self.x - 6
				end 
				
				Q_屏幕.风格提示.y = self.y - 28
			end 
		end 
	end 

end





--=============================================================================--
-- ■ 能否拿起()
--=============================================================================--

function 格子_包裹格子:能否拿起()


	if (self.标识 >2000 and self.标识 <= 2005) then  -- 如果是翻牌格子
		return false
	end

	if (self.道具.id > 0) then 
		
		return true 
	end 
	
	

	return false 

end 




--=============================================================================--
-- ■ 消耗
--=============================================================================--

function 格子_包裹格子:消耗()
	
	if (self.道具.数量 > 0) then 
		self.道具.数量 = self.道具.数量 - 1
		
	end 
	
	if (self.道具.数量 == 0) then 
		local 本次物品ID = self.道具标识
		self.道具标识 = 0
		
		
	end 
	
--	Q_屏幕:更新负重()
	
end 



--=============================================================================--
-- ■ 发动道具
--=============================================================================--

function 格子_包裹格子:发动道具()


	if (self.道具.子类 == "药水") then 
		
		
		if (self.道具.物理攻击 > 0) then
			Q_主角:HP增加(self.道具.物理攻击)	
			
		end
		
		if (self.道具.魔法攻击 > 0) then
			Q_主角:MP增加(self.道具.魔法攻击)	
		end
		
		self:播放音效()
		
		self:消耗()
		
	elseif (self.道具.子类 == "技能") then 
		
		if (self.道具.限制职业 ~= Q_主角.职业) then
			MSG(1,"职业不符！无法学习！"  ,-1652581,颜色_全透明)
		else
			
			
			for n=1,#Q_屏幕.技能窗口.技能格子组 do
				
				local 本次对象 = Q_屏幕.技能窗口.技能格子组[n].技能
				
				if (本次对象 ~= nil ) then
					if (本次对象.名称 == self.道具.名称) then
						if (本次对象.等级 > 0) then -- 已经学了
							Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"此技能已经掌握！无法重复学习！" ,"确认")
							break
						else
							本次对象.等级 = 1
							本次对象.熟练 = 0
							Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,string.format("成功学习技能 [%s]",self.道具.名称) ,"确认")
							self:消耗()
						end
					end

				end

			end

		end

	end



--	
--	if (self.道具.子类 == "药水") then 
--		
--		if (取实际(self.道具.最小攻击) > 0) then 
--		
--			if ( self.道具.敏捷 == 1) then -- 带CD药水
--				
--				if ( Q_全局CD.HP_延时时间 == 0 ) then 
--					指定英雄.红药水恢复.每秒 = 取实际(self.道具.最小攻击)
--					指定英雄.红药水恢复.总时间 = self.道具.命中 - 1
--					指定英雄.红药水恢复.计次 = 0
--					指定英雄.红药水恢复.结束 = false 
--					指定英雄.红药水恢复.进度 = 0
--					
--					Q_全局CD.HP_延时时间 = self.道具.命中  + 1  -- CD时间
--					Q_全局CD.HP_延时参考 = 0
--					Q_全局CD.HP_延时进度 = 0
--					
--					Q_系统:增加BUFF效果(指定英雄,"HP", self.道具.命中 + 1,"恢复生命")
--					
--					self:播放音效()
--				else 
--					MSG(1,"药品还没准备好!"  ,颜色_红,颜色_白)
--					return 
--				end 
--				
--			else
--				指定英雄:HP增加(取实际(self.道具.最小攻击)) -- 无CD药水
--				if (取实际(self.道具.最大攻击) == 0) then -- 只播放一次音效
--					self:播放音效()
--				end 
--			end 
--			
--		end 
--		
--		
--		if (取实际(self.道具.最大攻击) > 0) then 
--		
--			if ( self.道具.敏捷 == 1) then -- 带CD药水
--				
--				if ( Q_全局CD.MP_延时时间 == 0 ) then 
--					指定英雄.蓝药水恢复.每秒 = 取实际(self.道具.最大攻击)
--					指定英雄.蓝药水恢复.总时间 = self.道具.命中 - 1
--					指定英雄.蓝药水恢复.计次 = 0
--					指定英雄.蓝药水恢复.结束 = false 
--					指定英雄.蓝药水恢复.进度 = 0
--					
--					Q_全局CD.MP_延时时间 = self.道具.命中  + 1  -- CD时间
--					Q_全局CD.MP_延时参考 = 0
--					Q_全局CD.MP_延时进度 = 0
--					
--					Q_系统:增加BUFF效果(指定英雄,"MP", self.道具.命中 + 1,"恢复法力")
--					self:播放音效()
--				else 
--					MSG(1,"药品还没准备好!"  ,颜色_红,颜色_白)
--					return 
--				end 
--				
--			else
--				指定英雄:MP增加(取实际(self.道具.最大攻击)) -- 无CD药水
--				self:播放音效()
--			end 
--		
--		end 
--		
--		
--		self:消耗()
--		
--	elseif (self.道具.子类 == "神水") then 

--		if (self.道具.名称 == "聚元水") then
--			
--			Q_屏幕.max内力值 = Q_屏幕.max内力值 + 20
--			if (Q_屏幕.max内力值 > 3000 ) then
--				Q_屏幕.max内力值 = 3000
--			end 
--			
--			self:播放音效()
--			self:消耗()
--			
--		end 

--		
--		
--	elseif (self.道具.子类 == "秘籍技能") then 
--		self:播放音效()
--		if (Q_屏幕.江湖秘籍窗口:检查秘籍是否已学(取实际(self.道具.最小攻击)) == false) then -- 可学
--			Q_屏幕.江湖秘籍窗口:新增秘籍(取实际(self.道具.最小攻击))
--			self:消耗()
--			if (Q_屏幕.江湖秘籍窗口.可视 == false) then -- 直接显示到秘籍面板
--				Q_屏幕.江湖秘籍窗口:切换到子夹(4)	
--				Q_屏幕.江湖秘籍窗口:开关()
--			end
--			
--		else
--			Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"此秘籍已经掌握！无法重复学习！" ,"确认")
--		end
--		
--		
--	elseif (self.道具.子类 == "英雄技能") then 
--		self:播放音效()
--		if (self.道具.限制职业 ~= Q_屏幕.选中英雄.职业) then
--			MSG(1,"职业不符！无法学习！"  ,颜色_黄,颜色_红)
--		else
--			
--			for n=1,# Q_屏幕.选中英雄.技能组 do
--				if ( Q_屏幕.选中英雄.技能组[n].编号 == 取实际(self.道具.最小攻击)) then -- ID符合
--					
--					if (Q_屏幕.选中英雄.技能组[n].等级 > 0) then -- 已经学习
--						Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"此技能已经掌握！无法重复学习！" ,"确认")
--						return
--					else	
--						Q_屏幕.选中英雄.技能组[n].等级 = 1
--						Q_屏幕.选中英雄.技能组[n].经验 = 0
--						Q_屏幕.选中英雄.技能组[n].可用 = true
--						
--						local 子夹索引 = 0
--						
--						if (Q_屏幕.选中英雄.职业 == "弓手") then
--							子夹索引 = 1
--						elseif (Q_屏幕.选中英雄.职业 == "战士") then
--							子夹索引 = 2
--						elseif (Q_屏幕.选中英雄.职业 == "法师") then
--							子夹索引 = 3
--						end
--						
--						if (子夹索引 > 0) then
--							Q_屏幕.江湖秘籍窗口.子夹组[子夹索引].技能组[n].未掌握 = false  -- n就是技能索引
--							Q_屏幕.江湖秘籍窗口.子夹组[子夹索引].技能等级组[n] = 1
--						else
--							Q_屏幕.信息框:提示(-1,-1,"学习失败！" ,"确认")
--							return
--						end		
--						Q_屏幕.信息框:提示(-1,-1,string.format("%s 成功学习技能 [%s]",Q_屏幕.选中英雄.名称,self.道具.名称) ,"确认")
--						self:消耗()
--						return
--					end 	
--				end
		
--			end
	
--		end

--	end 

end 





--=============================================================================--
-- ■ 鼠标右键单击逻辑
--=============================================================================--

function 格子_包裹格子:鼠标右键单击逻辑()


	if (self.道具标识 > 0 and Q_游戏数据.鼠标道具.id ==0 ) then
		
		
		if (self.标识 >= 1 and  self.标识 <= 326) then   -- 如果是包裹格子 快捷格子
				
			if (Q_屏幕.商店窗口.可视) then
				
				
				if (Q_屏幕.信息框.可视 == false) then 
				
					if (self.道具.数量 == 1) then  -- 单个物品 直接销售
						
						Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,
						string.format("出售[%s]\n%s",self.道具.名称,按行格式化文本("总出售价格为" .. 取整(self.道具.价格/2) .. "金币\n确定要出售吗？",文字,13)),
						"确认取消","出售道具",self.道具 ,1)
						
						
						
						
					--	Q_系统:增加金币(self.道具.价格/2 )
						self.道具标识 = 0
						return
					else 
						
						Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"","数量输入","出售",self.道具)
						
						--Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,self.道具,"出售_数量输入")
						self.道具标识 = 0
						return
					end
				end 
			else

				if (self.道具.限制职业 ~= "通用"  and self.道具.限制职业 ~= Q_主角.职业) then 
					--MSG(1,"职业不符！无法使用！"  ,颜色_黄,颜色_红)
					return 
				end
				
	
				if (self.道具.需要等级 > Q_主角.属性.等级) then -- 等级不足
				--	Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"等级不足！" ,"确认")
				--	MSG(1,"等级不足！" ,颜色_黄,颜色_红)
					return 
				end
	
				
				self:发动道具()
				
				Q_当前道具 = self
				
				if ( Q_物品脚本组[self.道具.名称] ~= nil ) then 
					Q_物品脚本组[self.道具.名称].Main()
				end

				if (self.道具.总类 == "装备") then  -- 可装备到身上的道具
					self:右键_身上格子填充道具()
				end 

			end

		elseif (self.标识 > 500 and  self.标识 < 510) then 
			self:右键_身上格子卸掉道具()

		elseif (self.标识 > 1000 and self.标识<=1500) then  -- 商店格子
			
		
			if ( self.道具.可叠加 == false ) then -- 如果是不可叠加的道具 就直接购买  叠加类道具需要弹出数量出入框 
				if (self.道具.价格 > Q_游戏数据.金币) then
					Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,string.format("金币不足，缺少%d金币！",self.道具.价格 - Q_游戏数据.金币),"确认")
				else
					
				
					if (Q_屏幕.包裹窗口:增加物品(self.道具,1))then 
						Q_系统:增加金币(- self.道具.价格 )
					end 
				end
			else
				if (self.道具.价格 > Q_游戏数据.金币) then
					Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,string.format("金币不足，缺少%d金币！",self.道具.价格 - Q_游戏数据.金币),"确认")
				else
					Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,"","数量输入","购买",self.道具)
				end 
			end 
		end
	--	Q_屏幕:更新负重()
	end

end




--=============================================================================--
-- ■ 右键_身上格子填充道具()
--=============================================================================--

function 格子_包裹格子:右键_身上格子卸掉道具()

	if (Q_屏幕.包裹窗口:增加物品(self.道具,1)) then 
		Q_主角:更新纸娃娃(self.类别,"默认",self.道具.子类)
		self.道具标识 = 0
		Q_屏幕:主角属性更新()
	end 
end 

--=============================================================================--
-- ■ 右键_身上格子填充道具()
--=============================================================================--

function 格子_包裹格子:右键_身上格子填充道具()

	local 本次道具id = self.道具.id
	
	
	

	if (self.道具.分类 == "头饰") then 	
		self:右键_装备道具(1)
		
	elseif (self.道具.分类 == "上衣") then 		
		self:右键_装备道具(2)	
		
	elseif (self.道具.分类 == "首饰") then 		
		
		if (self.道具.子类 == "项链") then 		
			self:右键_装备道具(3)	
		elseif (self.道具.子类 == "手镯") then 	
			self:右键_装备道具(6)
		elseif (self.道具.子类 == "戒指") then 	
			self:右键_装备道具(9)	
		end
		
		
	elseif (self.道具.分类 == "武器") then 		
		self:右键_装备道具(4)	
		
	elseif (self.道具.分类 == "腰带") then 		
		self:右键_装备道具(5)	
		
	elseif (self.道具.分类 == "鞋子") then 		
		self:右键_装备道具(7)	
		
	elseif (self.道具.分类 == "下装") then 		
		self:右键_装备道具(8)	
	
	end
	
--	if (Q_房间信息.进入) then
--		if (类型 == "衣服" or 类型 == "武器" or 类型 == "副手") then -- 发送换装通知
--			发送封包(12,Q_屏幕.关卡地图.id,0,类型,self.道具.id,self.道具.品级) 
--			调试输出(2)
--		end
--	end

--	self:执行道具脚本(本次道具id)
	
end 



--=============================================================================--
-- ■ 是商店格子()
--=============================================================================--

function 格子_包裹格子:是商店格子()

	if (self.标识 > 1000 and self.标识<=2000) then 
		return true
	else
		return false
	end 


end 


--=============================================================================--
-- ■ 是仓库格子()
--=============================================================================--

function 格子_包裹格子:是仓库格子()



	if (self.标识 > 5000 ) then 
		if (Q_游戏数据.鼠标道具.道具.总类 == "任务") then
			MSG(1,"任务道具不可移动至此！"  ,颜色_白,颜色_蓝)
			return false
		end 

		return true
	else
		return false
	end 


end



--=============================================================================--
-- ■ 是随身包裹格子()
--=============================================================================--

function 格子_包裹格子:是随身包裹格子()


	if (self.标识 > 3000 and self.标识 <= 3080) then 
	
		if (Q_游戏数据.鼠标道具.道具.总类 == "任务") then
			MSG(1,"任务道具不可移动至此！"  ,颜色_白,颜色_蓝)
			return false
		end 
		return true
	else
		return false
	end 


end



--=============================================================================--
-- ■ 右键_装备道具()
--=============================================================================--

function 格子_包裹格子:右键_装备道具(目标格子)

	if (self.标识 <= 326  ) then  -- 是包裹和快捷键中的
			
		if (Q_屏幕.包裹窗口.身体格子[目标格子].道具标识 == 0) then -- 如果没有物品 就装备上
		
			Q_屏幕.包裹窗口.身体格子[目标格子]:置道具(self.道具,1 ,true)
			self.道具标识= 0
			
		else 								-- 如果有 就交换
		
			Q_屏幕.包裹窗口.身体格子[目标格子].道具,self.道具 = self.道具 ,Q_屏幕.包裹窗口.身体格子[目标格子].道具
			self:置道具(self.道具,1,true)
			Q_屏幕.包裹窗口.身体格子[目标格子]:置道具(Q_屏幕.包裹窗口.身体格子[目标格子].道具,1)
			
		end 
		
		
	end
		

end 




--=============================================================================--
-- ■ 检测是否可放()
--=============================================================================--

function 格子_包裹格子:检测是否可放()
	

	if (self.标识 >= 1 and  self.标识 <= 326  ) then   -- 如果是包裹格子 和快捷格子
	
		if (Q_游戏数据.最后点击格子.标识 > 1000  and Q_游戏数据.最后点击格子.标识<=1500) then  -- 商店里面拿出的物品
			
			
			if (Q_游戏数据.鼠标道具.道具.价格 > Q_游戏数据.金币) then
			
				Q_屏幕.信息框:提示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y,string.format("金币不足，缺少%d金币！",Q_游戏数据.鼠标道具.道具.价格 - Q_游戏数据.金币),"确认")
				
				Q_游戏数据.鼠标道具.id = 0
				
			else
			--	MSG("[系统]", string.format("得到%s,失去银子%d",Q_游戏道具组[Q_游戏数据.鼠标道具.id].名称,Q_游戏道具组[Q_游戏数据.鼠标道具.id].价格) ,颜色_黄)
			
				if (Q_屏幕.包裹窗口:增加物品(Q_游戏数据.鼠标道具.道具,Q_游戏数据.鼠标道具.道具.数量))then 
					Q_系统:增加金币(- Q_游戏数据.鼠标道具.道具.价格 )
					Q_游戏数据.鼠标道具.id = 0
				end 
				
				
			end
			
			return false
			
		else
			
			
			return true
			
		end 
		

	end 
	
	
	if (self.标识 > 500 and self.标识 < 510 ) then   -- 身体保留格子
		if (Q_游戏数据.最后点击格子.标识 > 1000  and Q_游戏数据.最后点击格子.标识<=2000) then  -- 商店里面拿出的物品,不能直接穿到身上
			return  false
		end 

	--	调试输出(self.类别, Q_游戏数据.鼠标道具.道具.分类)
		
		-- 不是通用的道具 也不是符合主角职业则返回假
		if ( Q_游戏数据.鼠标道具.道具.限制职业 ~= "通用"  and  Q_主角.职业 ~= Q_游戏数据.鼠标道具.道具.限制职业 ) then 
			return false 
		end
		
		
		
		if ( Q_游戏数据.鼠标道具.道具.分类  == "首饰") then
			
			if (self.类别 == Q_游戏数据.鼠标道具.道具.子类 ) then
				
				if (Q_游戏数据.鼠标道具.道具.需要等级 <=  Q_主角.属性.等级) then 
					return true   
				else 
					--MSG(1,"等级不足！" ,颜色_黄,颜色_红)
					return false 
				end 
				
				
			end
			
		elseif (self.类别 ==  Q_游戏数据.鼠标道具.道具.分类  ) then   
			
			if (Q_游戏数据.鼠标道具.道具.需要等级 <=  Q_主角.属性.等级) then 
				return true   
			else 
				--MSG(1,"等级不足！" ,颜色_黄,颜色_红)
				return false 
			end 
		end
	end 

	return false
end 


--=============================================================================--
-- ■ 显示
--=============================================================================--
function 格子_包裹格子:显示(偏移Y)


	if (偏移Y == nil) then 
		偏移Y = 0
	end 
	self.偏移Y = 偏移Y
	self.包围盒:置位置(self.x,self.y + self.偏移Y)
	

	if(self.道具标识 ~= 0) then
		
		self.道具.精灵:显示(self.x+14 ,self.y+14+ self.偏移Y)	
		
		if (self.道具.数量> 1) then 
			文字_描边显示(文字,self.x+3 ,self.y +15+ self.偏移Y ,string.format("%4d",self.道具.数量),颜色_白,颜色_黑)
		end 
	end 

	
	if ( self.焦点 ) then 
		Q_游戏数据.精灵组.格子点燃精灵:显示(self.x -1,self.y -1+ self.偏移Y)
	end 
	
	
	if (Q_调试) then
		self.包围盒:置颜色(颜色_黄)
		self.包围盒:显示()
		文字:显示(self.x ,self.y + self.偏移Y, self.标识)
	end

end

--=============================================================================--
-- ■ 更新道具属性()
--=============================================================================--

function 格子_包裹格子:更新道具属性()
	self.风格提示 = {}
	self.风格提示.原始内容 = 格式化道具属性(self.道具,false)
	self.风格提示.风格文字组, self.风格提示.宽度 , self.风格提示.高度 = 格式化文字 (文字,self.风格提示.原始内容,3) 
end 


--=============================================================================--
-- ■ 播放音效()
--=============================================================================--

function 格子_包裹格子:播放音效()
	
	播放道具音效(self.道具)

end 


--=============================================================================--
-- ■ 置道具()
--=============================================================================--

function 格子_包裹格子:置道具(道具,数量,是否播放音效)

	
	self.道具标识 = 道具.id
	self.道具 = nil
	self.道具 = 复制表(道具)
	self.道具.数量 = 数量
	
	
	
	if (self.道具标识 >0 ) then 
		self:更新道具属性()
		Q_主角:更新纸娃娃(self.类别,self.道具.名称,self.道具.子类)
	end
	
	
	if (是否播放音效 == true ) then 
		self:播放音效()
	end 
	
	
	if (self.标识 > 500 and  self.标识 < 510) then 
		Q_屏幕:主角属性更新()
	end

	
--	if (self.道具标识 >0 ) then 
--	
--		self:更新道具属性()
--		
--		if (Q_屏幕.网络.状态 == 3 and Q_游戏数据.最后点击格子 ~= nil) then 
--			
--			
--			if(Q_游戏数据.最后点击格子.标识 == 201 ) then -- 盔甲格子拿走
--				发送封包(8,0,Q_屏幕.关卡地图.id,"衣服",Q_屏幕.包裹窗口.身体格子[1].道具标识,1) 
--			elseif(Q_游戏数据.最后点击格子.标识 == 202 ) then -- 武器格子拿走	
--			
--				local 武器品级 = 1
--				
--				if (Q_屏幕.包裹窗口.身体格子[2].道具标识 ~= 0) then  -- 有武器
--					武器品级 = Q_屏幕.包裹窗口.身体格子[2].道具.品级
--				end 
--				
--				发送封包(8,0,Q_屏幕.关卡地图.id,"武器",Q_屏幕.包裹窗口.身体格子[2].道具标识,武器品级) 
--			elseif(Q_游戏数据.最后点击格子.标识 == 206 ) then -- 副手格子拿走	
--				发送封包(8,0,Q_屏幕.关卡地图.id,"副手",Q_屏幕.包裹窗口.身体格子[6].道具标识,1) 
--			end
--			
--		end 
--		
	
--		if ( 是否更新纸娃娃 == nil or 是否更新纸娃娃 == true ) then 
--			
--			if (self.类别 == "衣服" or self.类别 == "武器" or self.类别 == "副手") then
--				
--				local 本次更新英雄 = Q_屏幕.选中英雄
--				
--				if ( self.所属英雄 ~= nil) then
--					本次更新英雄 = self.所属英雄
--				end 
--				
--				if (Q_屏幕.网络.状态 == 3) then
--					if (Q_游戏数据.最后点击格子 ~= self) then  -- 发送封包通知换装
--						发送封包(8,0,Q_屏幕.关卡地图.id,self.类别,self.道具.id,self.道具.品级) 
--					end 
--				end

--				指定英雄纸娃娃更新(self.类别,self.道具.名称,本次更新英雄,self.道具.品级)
--				
--				self:英雄装备属性更新判断(本次更新英雄)

--			end

--		end 

--	
--	end 


end


--=============================================================================--
-- ■ 置位置()
--=============================================================================--

function 格子_包裹格子:置位置(x坐标,y坐标)

      self.x =  x坐标
      self.y =  y坐标
      
      self.包围盒:置位置(self.x,self.y)

end


--=============================================================================--
-- ■ 道具出售()
--=============================================================================--

function 格子_包裹格子:道具出售(数量)


	Q_系统:增加金币(self.道具.价格/2 * 数量)
	
	if (数量 == 取实际(self.道具.数量)) then 
		self.道具.id = 0
		self.道具标识 = 0
	else 
		self.道具.数量 = 增减游戏变量__(self.道具.数量, -数量)
		
	end 
	
	Q_屏幕:更新负重()
	
end



--=============================================================================--
-- ■ 英雄装备属性更新判断()
--=============================================================================--

function 格子_包裹格子:英雄装备属性更新判断(英雄对象)

	if ( 英雄对象 == nil ) then
		英雄对象 = Q_屏幕.选中英雄
	end

	if (self.标识 >= 201 and self.标识 <= 408 ) then   
	
		英雄对象:身体装备属性更新()
		
	end 
	

end 


--=============================================================================--
-- ■ 取空插槽ID()
--=============================================================================--

function 格子_包裹格子:取空插槽ID()
	
	if ( #self.道具.插槽状态 > 0) then
		
		for n=1,#self.道具.插槽状态 do
			
			if (self.道具.插槽状态[n].宝石 == 0) then
				return n
			end
			
		end
		
	end
	
	return 0
	
end 



--=============================================================================--
-- ■ 取已镶嵌槽数()
--=============================================================================--

function 格子_包裹格子:取已镶嵌槽数()
	
	local 已镶嵌 = 0
	
	if ( #self.道具.插槽状态 > 0) then
		
		for n=1,#self.道具.插槽状态 do
			
			if (self.道具.插槽状态[n].宝石 ~= 0) then
				已镶嵌 = 已镶嵌 + 1
			end
			
		end
		
	end
	
	return 已镶嵌
	
end 


--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 格子_包裹格子:销毁()	
	self.包围盒 = nil
	self = nil
end



