--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年3月28日10时29分47秒
--=============================================================================--

类_主屏幕  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_主屏幕:初始化()
	
	self.分辨率偏移 = 取整_( Q_游戏数据.屏幕宽度 - 640) /2 
	
	self.UI_底部快捷栏图片 = 引擎:载入图片("Dat/ui/底部UI.png")
	self.UI_底部快捷栏精灵 = D2D_精灵.创建(self.UI_底部快捷栏图片,0,0,680,78)
	
	self.UI_底部快捷键图片 = 引擎:载入图片("Dat/ui/快捷栏条.png")
	self.UI_底部快捷键精灵 = D2D_精灵.创建(self.UI_底部快捷键图片,0,0,476,10)
	
	self.UI_顶部HMP栏图片 = 引擎:载入图片("Dat/ui/人物HMP栏.png")
	self.UI_顶部HMP栏精灵 = D2D_精灵.创建(self.UI_顶部HMP栏图片,0,0,197,29)
	
	self.UI_小地图标题栏图片 = 引擎:载入图片("Dat/ui/小地图_标题栏.png")
	self.UI_小地图标题栏精灵 = D2D_精灵.创建(self.UI_小地图标题栏图片,0,0,169,24)
	
	self.UI_小地图背景框图片 = 引擎:载入图片("Dat/ui/小地图背景框.png")
	self.UI_小地图背景框精灵 = D2D_精灵.创建(self.UI_小地图背景框图片,0,0,169,73)
	

	
	self.主角hp图片 = 引擎:载入图片("Dat/ui/hp.png")
	self.主角hp精灵 = D2D_精灵.创建(self.主角hp图片,0,0,35,65)
	
	self.主角mp图片 = 引擎:载入图片("Dat/ui/mp.png")
	self.主角mp精灵 = D2D_精灵.创建(self.主角mp图片,0,0,35,65)
	
	self.主角HP包围盒  = D2D_包围盒.创建(5+self.分辨率偏移,410,38,100)
	self.主角MP包围盒  = D2D_包围盒.创建(598+self.分辨率偏移,410,38,100)
	
	
	
--	临时图片 = 引擎:载入图片("Dat/001.Png")
--	临时精灵 = D2D_精灵.创建(临时图片,0,0,引擎:取图片宽度(临时图片),引擎:取图片高度(临时图片))
--	
	
	
	self.UI_人物属性按钮 = 类_三层序列图按钮.创建("Dat/ui/人物属性按钮.png", 311+self.分辨率偏移, 426,false,"状态[U]",-22,-30)
	self.UI_人物包裹按钮 = 类_三层序列图按钮.创建("Dat/ui/人物包裹按钮.png",335+self.分辨率偏移, 436,false,"包裹[I]",-22,-30)
	self.UI_人物技能按钮 = 类_三层序列图按钮.创建("Dat/ui/人物技能按钮.png",287+self.分辨率偏移, 436,false)
	self.UI_游戏任务按钮 = 类_三层序列图按钮.创建("Dat/ui/游戏任务按钮.png",277+self.分辨率偏移, 460,false)
	self.UI_系统设置按钮 = 类_三层序列图按钮.创建("Dat/ui/系统设置按钮.png",345+self.分辨率偏移, 460,false)
	
	self.UI_小地图开关按钮 = 类_三层序列图按钮.创建("Dat/ui/小地图开关按钮.png", Q_游戏数据.屏幕宽度-20, 3,false,"小地图开关",-74,-30)
	

	
	self.屏幕物件组 = {}
	self.屏幕特效组 = {}
	self.屏幕怪物组 = {}
	self.屏幕NPC组 = {}
	self.屏幕子弹组 = {}
	
	self.地面物品组 = {}
	self.地图物件组 = {}
	
	
	
	self.物件排序方法 = function(物件a, 物件b) 
							if(物件a.排序参照点 == 物件b.排序参照点) then 	
								return 物件a.物件ID < 物件b.物件ID 
							else 
								return 物件a.排序参照点 < 物件b.排序参照点
							end 
						end 
	
	self.排序计次 = 0
	
	
	self.主角HP提示 = false
	self.主角MP提示 = false
	
	self.最顶气泡显示 = false
	self.小地图显示 = true
	
	
	self.风格提示= {
			风格文字组 = {},
			宽度 = 0,
			高度 = 0,
			x = 0,
			y = 0,
			类型 = 1,
			通明度 = 220
	}
	
	self.上次商店 = {
		NPC标识= "",
		行数= 0
	}
	
	
	self.掉血精灵文字 = 类_精灵文字.创建()
	self.顶部动态血条 = 类_屏幕血条进度类.创建()
	self.信息框 = 信息提示框.创建()
	self.聊天显示框 = 类_信息显示框.创建(7,24,0,50)
	
	
	self.包裹窗口 = 类_窗口_角色包裹.创建(300,30 )
	self.包裹窗口.排序ID = 1
	
	
	self.状态窗口 = 类_窗口_角色状态.创建(100,30 )
	self.状态窗口.排序ID = 2
	
	self.商店窗口 = 类_窗口_道具商店.创建(100,100 )
	self.商店窗口.排序ID = 3
	
	self.技能窗口 = 类_窗口_技能窗口.创建(20,50 )
	self.技能窗口.排序ID = 4
	
	
	
	self.窗口id = 0
	self.鼠标窗口全id = 0
	self.移动焦点窗口 = false
	
	self.界面_窗口_数组 = {self.包裹窗口,self.状态窗口,self.商店窗口,self.技能窗口}
	
	self.窗口排序方法 = function(窗口a, 窗口b) 
								if(窗口a.最后激活时间 == 窗口b.最后激活时间) then 	
									return 窗口a.排序ID < 窗口b.排序ID 
								else 
									return 窗口a.最后激活时间< 窗口b.最后激活时间
								end 
							  end 
	
	
	self.道具快捷组 = {}
	self.技能快捷组 = {}
	
	
	for n=1,6 do
		self.道具快捷组[n] =格子_包裹格子.创建(76 + 31*(n-1),447 ,28,28,320+n,"快捷")
	end
	
	
	for n=1,6 do
		self.技能快捷组[n] =类_技能格子.创建(381 + 31*(n-1),447 ,50+n)
	end


--	self.技能快捷组[1]:置技能(Q_游戏数据.游戏技能组["前踢"])

	
end


--=============================================================================--
-- ■ 对象初始化
--=============================================================================--
function 类_主屏幕:对象初始化()


	初始化特效数据()
	
	
	Q_系统 = 类_系统类.创建()
	
	Q_NPC对话框 =  NPC对话框类.创建()
	Q_菜单 = 屏幕菜单.创建()
	
	Q_地图 = 类_主地图.创建()
	
	Q_主角 = 类_主角_格斗家.创建(400,380)
	
	Q_地图:加载地图("艾尔文防线") -- 艾尔文防线
	
	
	self:增加屏幕物件(Q_主角)
	
	Q_屏幕:主角属性更新()
	


--	Q_系统:增加怪物(600,380,"投掷哥布林")
--	Q_系统:增加怪物(650,340,"哥布林")

	
	self.包裹窗口:重置(6)
	
	
	
	self.包裹窗口.包裹格子[1]:置道具(Q_游戏数据.游戏道具组[2],1,false)
	self.包裹窗口.包裹格子[2]:置道具(Q_游戏数据.游戏道具组[3],1,false)
	self.包裹窗口.包裹格子[3]:置道具(Q_游戏数据.游戏道具组[4],1,false)
	self.包裹窗口.包裹格子[4]:置道具(Q_游戏数据.游戏道具组[5],1,false)
	
	self.包裹窗口.包裹格子[5]:置道具(Q_游戏数据.游戏道具组[6],1,false)
	self.包裹窗口.包裹格子[6]:置道具(Q_游戏数据.游戏道具组[7],1,false)
	self.包裹窗口.包裹格子[7]:置道具(Q_游戏数据.游戏道具组[8],1,false)
	self.包裹窗口.包裹格子[8]:置道具(Q_游戏数据.游戏道具组[9],1,false)
	
	
	self.包裹窗口.包裹格子[9]:置道具(Q_游戏数据.游戏道具组[10],1,false)
	self.包裹窗口.包裹格子[10]:置道具(Q_游戏数据.游戏道具组[11],1,false)
	self.包裹窗口.包裹格子[11]:置道具(Q_游戏数据.游戏道具组[12],1,false)
	self.包裹窗口.包裹格子[12]:置道具(Q_游戏数据.游戏道具组[13],1,false)
	self.包裹窗口.包裹格子[13]:置道具(Q_游戏数据.游戏道具组[14],1,false)
	self.包裹窗口.包裹格子[14]:置道具(Q_游戏数据.游戏道具组[15],1,false)
	self.包裹窗口.包裹格子[15]:置道具(Q_游戏数据.游戏道具组[16],1,false)
	
	
	self.技能窗口.技能格子组[1]:置技能(Q_游戏数据.游戏技能组["前踢"])
	self.技能窗口.技能格子组[2]:置技能(Q_游戏数据.游戏技能组["下段踢"])
	
	
--	
--	
	
	
	--self.聊天显示框:更新聊天数据()
--	
--	MSG(1,"已开启拍卖行",-52686 ,颜色_全透明)
--	MSG(1,"已开启金币寄售系统",-52686 ,颜色_全透明)
--	MSG(1,"活动-正在进行[上线100%送套房活动]",-1652581 ,颜色_全透明)
--	
	MSG(1,"欢迎进入[阿拉德外传]试玩版!",-1652581 ,颜色_全透明)
	MSG(1,"游戏版本号:v0.1",-1652581 ,颜色_全透明)
	MSG(1,"论坛地址:http://www.gamelua.com",颜色_黄 ,颜色_全透明)
	
	
	
end




--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_主屏幕:更新()
	
	
	if (引擎:取按键按下(键_空格)) then
		
		--self.信息框:提示(-1,-1,"金币不足，缺少%d金币！","确认" )
		--Q_系统:掉落物品("初级HP恢复药水",Q_主角.坐标.x,Q_主角.坐标.y,1) 
		--MSG(1,"上帝红色的觉得舒服寄售考虑是的就流口水了我饿金融联考我饿了是的发生的我饿惹我我" .. 引擎:取随机整数(1,3),-1652581 ,颜色_全透明)
		--self.聊天显示框:更新渲染()
		
		
		Q_系统:增加怪物(600,380,"牛头怪")
		
		
		
	end
	
	
	self.最顶气泡显示 = false
	
	
	self.UI_人物属性按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.UI_人物包裹按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.UI_人物技能按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.UI_游戏任务按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.UI_系统设置按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.UI_小地图开关按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	

	for n=1,6 do
		self.道具快捷组[n]:更新()
	end
	
	for n=1,6 do
		self.技能快捷组[n]:更新()
	end
	
	
	for n=1,#Q_屏幕.技能窗口.技能格子组 do
		
		local 本次对象 = Q_屏幕.技能窗口.技能格子组[n].技能
		
		if (本次对象 ~= nil and 本次对象.等级 > 0) then
			
			本次对象.可用 = true
			
			if ( 本次对象.名称 == "前踢" ) then
				if ( Q_主角.小砍攻击中 or Q_主角.状态 == "下段踢" ) then
					本次对象.可用 = false
				end

			end
			
			if ( 本次对象.名称 == "下段踢" ) then
				if ( Q_主角.小砍攻击中 or Q_主角.状态 == "前踢") then
					本次对象.可用 = false
				end

			end
			
			
			
			
			
			
			if ( 本次对象.延时时间 ~= 0) then
				
				本次对象.延时时间参考 =  本次对象.延时时间参考 + dt
				
				if (本次对象.延时时间参考 >= 本次对象.延时时间) then
					本次对象.延时时间参考 = 0
					本次对象.延时时间 = 0
					本次对象.特效显示 = true 
				end
				
			end
			
			if (本次对象.特效显示 ) then 
				本次对象.CD特效:更新(8,31,39)
				
				if (本次对象.CD特效:取间隔帧()>7) then 
					本次对象.特效显示 = false 
				end 
				
			end 
		end
		
	end
	

	

	
	
	
	self.聊天显示框:更新()
	Q_NPC对话框:更新()
	self.信息框:更新()
	
	self:键盘快捷键逻辑()


	
	if(self.鼠标窗口全id == 0) then
		
		if( self.UI_人物属性按钮:取是否单击() )then          -- 包裹按钮事件
			self.状态窗口:开关()
		elseif(self.UI_人物包裹按钮:取是否单击())then          -- 任务按钮事件
			self.包裹窗口:开关()
		elseif(self.UI_人物技能按钮:取是否单击())then          -- 任务按钮事件
			self.技能窗口:开关()
		elseif(self.UI_小地图开关按钮:取是否单击())then          -- 小地图按钮被单击
			self.小地图显示 = not self.小地图显示
			
		end
		
	end
	
	
	
	
	
	
	
	self.顶部动态血条:更新()
	
	
	for n=1, #self.界面_窗口_数组 do
		self.界面_窗口_数组[n]:更新()
	end
	
	if(引擎:取按键按下(键_鼠标左))  then
		self:鼠标左键按下()
	end
	
	if(引擎:取按键按下(键_鼠标右))  then
		self:鼠标右键按下()
	end
	
	
	
	
	
	if(引擎:取按键弹起(键_鼠标左))  then
		self.移动焦点窗口 = false
		
	end
	
	
	
      if(self.移动焦点窗口 == true) then
		self.界面_窗口_数组[#self.界面_窗口_数组]:开始移动()
      end
	
      self.窗口id = self:取鼠标所在窗口()
	self.鼠标窗口全id = self:取鼠标所在窗口(true)
	
	
	
	Q_地图:更新()
	
	Q_主角:更新()

	
	
	
	
	
	for n=#self.屏幕怪物组,1,-1 do 
		self.屏幕怪物组[n]:更新()
	end 
	
	
	for n=#self.屏幕NPC组,1,-1 do 
		self.屏幕NPC组[n]:更新()
	end 
	
	
	
	for n=#self.屏幕特效组,1,-1 do 
		self.屏幕特效组[n]:更新()
		if (self.屏幕特效组[n].已经消失) then
			table.remove(self.屏幕特效组,n,1)
		end
	end 

	
	for n=#self.地面物品组,1,-1 do 
		self.地面物品组[n]:更新()
		if (self.地面物品组[n].已经消失) then
			self.地面物品组[n]:销毁()
			table.remove(self.地面物品组,n,1)
		end
	end 	
	
	
	for n=#self.屏幕子弹组,1,-1 do 
		self.屏幕子弹组[n]:更新()
		if (self.屏幕子弹组[n].已经消失) then
			self.屏幕子弹组[n]:销毁()
			table.remove(self.屏幕子弹组,n,1)
		end
	end 	
	
	
	
	
	
	
	for n=#self.地图物件组,1,-1 do 
		self.地图物件组[n]:更新()
--		if (self.地图物件组[n].已经消失) then
--			self.地图物件组[n]:销毁()
--			table.remove(self.地图物件组,n,1)
		--end
	end 	
	
	
	
	
	for n=#self.屏幕物件组,1,-1 do 
		if ( self.屏幕物件组[n].已经消失 and (self.屏幕物件组[n].标识类型 == "屏幕特效" or self.屏幕物件组[n].标识类型 == "地面掉落物")  ) then
			table.remove(self.屏幕物件组,n,1)
		end
	end 
	

	table.sort(self.屏幕物件组,self.物件排序方法)
	table.sort(self.界面_窗口_数组,self.窗口排序方法)



-- 此处可优化	
	
	if (self.主角HP包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)) then 
		if (self.主角HP提示 == false) then
			local 提示内容 = string.format("HP:%d/%d",Q_主角.属性.hp,Q_主角.属性.maxhp)
			self.风格提示.原始内容 = 提示内容
			self.风格提示.风格文字组, self.风格提示.宽度 , self.风格提示.高度 = 格式化文字 (文字,self.风格提示.原始内容,5) 
			self.风格提示.x = -1 + self.分辨率偏移
			self.风格提示.y = 380
			
			
			self.主角HP提示 = true
			
		end
		self.最顶气泡显示 = true
		
	else
		self.主角HP提示 = false
	end
	
	
	if (self.主角MP包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)) then 
		if (self.主角MP提示 == false) then
			local 提示内容 = string.format("MP:%d/%d",Q_主角.属性.mp,Q_主角.属性.maxmp)
			self.风格提示.原始内容 = 提示内容
			self.风格提示.风格文字组, self.风格提示.宽度 , self.风格提示.高度 = 格式化文字 (文字,self.风格提示.原始内容,5) 
			self.风格提示.x = 640  - 文字:取宽度(提示内容) - 15 + self.分辨率偏移
			self.风格提示.y = 380
			
			
			
			self.主角MP提示 = true
			
		end
		self.最顶气泡显示 = true
		
	else
		self.主角MP提示 = false
	end

	
	
	
	Q_菜单:更新()

	
	
	if (引擎:取按键按下(键_ESC)) then -- 包裹快捷键
		
		for n=#self.界面_窗口_数组,1,-1  do
			if (self.界面_窗口_数组[n].可视) then
				self.界面_窗口_数组[n]:开关()
				return
			end
		end
		
	end

	
	Q_游戏数据.画面偏移.x,Q_游戏数据.画面偏移.y = 引擎:取画面坐标(Q_主角.坐标.x,Q_主角.坐标.y,Q_地图.地图宽度,Q_地图.地图高度,Q_游戏数据.屏幕宽度,Q_游戏数据.屏幕高度)
	
	
	
end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_主屏幕:显示()


	Q_地图:显示()
	
	for n=1,#self.屏幕物件组 do
		self.屏幕物件组 [n]:显示()
	end
	
	Q_地图:显示顶层()
	
--	临时精灵:显示(224,280)
	
	if (self.小地图显示) then
	--	self.小地图精灵:显示(Q_游戏数据.屏幕宽度 - 166 - math.ceil(Q_主角.坐标.x/self.缩放倍数) -  math.ceil(Q_游戏数据.画面偏移.x/self.缩放倍数),20)
		Q_地图:显示小地图(Q_游戏数据.屏幕宽度 - 162,22)
		self.UI_小地图背景框精灵:显示(Q_游戏数据.屏幕宽度 - 166,20)
	end
	
	self.UI_小地图标题栏精灵:显示(Q_游戏数据.屏幕宽度 - 166,0)

	
	文字:显示(Q_游戏数据.屏幕宽度 - 116+math.ceil((90 -文字:取宽度(Q_地图.地图名称))/2),5,Q_地图.地图名称)

	
	
	self.UI_小地图开关按钮:显示()
	
	
	
	
--	self.UI_顶部HMP栏精灵:显示()


	self.UI_底部快捷栏精灵:显示(self.分辨率偏移-21,Q_游戏数据.屏幕高度 - 78)
	
	
	for n=1,6 do
		self.道具快捷组[n]:显示()
	end
	
	for n=1,6 do
		self.技能快捷组[n]:显示()
	end
	
	
	
	
	
	self.UI_人物属性按钮:显示()
	self.UI_人物包裹按钮:显示()
	self.UI_人物技能按钮:显示()
	self.UI_游戏任务按钮:显示()
	self.UI_系统设置按钮:显示()
	self.UI_底部快捷键精灵:显示(82+self.分辨率偏移,Q_游戏数据.屏幕高度 - 10)
	
	self.主角hp精灵:置显示区域 (0, (Q_主角.属性.maxhp - Q_主角.属性.hp) / Q_主角.属性.maxhp * 65, 35, 65 - (Q_主角.属性.maxhp - Q_主角.属性.hp) / Q_主角.属性.maxhp * 65)
	self.主角hp精灵:显示(6+self.分辨率偏移,413 + (Q_主角.属性.maxhp - Q_主角.属性.hp) / Q_主角.属性.maxhp * 65)

	self.主角mp精灵:置显示区域 (0, (Q_主角.属性.maxmp - Q_主角.属性.mp) / Q_主角.属性.maxmp * 65, 35, 65 - (Q_主角.属性.maxmp - Q_主角.属性.mp) / Q_主角.属性.maxmp * 65)
	self.主角mp精灵:显示(599+self.分辨率偏移,413 + (Q_主角.属性.maxmp - Q_主角.属性.mp) / Q_主角.属性.maxmp * 65)

	
	self.顶部动态血条:显示()
	self.聊天显示框:显示()
	
	
	for n=1, #self.界面_窗口_数组 do
		self.界面_窗口_数组[n]:显示()
	end
	
	
	if (self.包裹窗口.可视) then 
		self.包裹窗口:显示包裹装备属性()
	end 
	
	if (self.商店窗口.可视) then 
		self.商店窗口:显示商店装备属性()
	end 
	
	if (self.技能窗口.可视) then 
		self.技能窗口:显示包裹技能属性()
	end 
	

	
	self:显示快捷格子物品属性()
	
	
	self.信息框:显示()
	
	
	if (Q_游戏数据.鼠标道具.id ~= 0) then
		Q_游戏数据.鼠标道具.道具.精灵:置显示区域 (0 ,0,28,28)
		Q_游戏数据.鼠标道具.道具.精灵:置颜色(颜色_白)
		Q_游戏数据.鼠标道具.道具.精灵:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	end
	
	
	if (Q_游戏数据.鼠标技能.对象  ~= nil) then
		Q_游戏数据.鼠标技能.对象.精灵:显示(Q_游戏数据.鼠标坐标.x-14,Q_游戏数据.鼠标坐标.y-14)
	end
	
	
	
	
	
	
	if (self.最顶气泡显示) then 
		显示风格提示(self.风格提示.x,self.风格提示.y,self.风格提示.风格文字组,self.风格提示.宽度, self.风格提示.高度 ,self.风格提示.通明度,1,self.风格提示.类型) 
	end 
	
	
	
	
	Q_NPC对话框:显示()
	Q_菜单:显示()
	
	
	
	
	
	
	
	if (Q_调试) then
		self.主角HP包围盒:显示()
		self.主角MP包围盒:显示()
	end
	
	
	
end



--=============================================================================--
-- ■ 属性更新
--=============================================================================--
function 类_主屏幕:主角属性更新()

	Q_主角.属性.maxhp = 50 + (Q_主角.属性.等级 - 1 ) * 10
	Q_主角.属性.maxmp = 50 + (Q_主角.属性.等级 - 1 ) * 10
	
	
	
	Q_主角.属性.力量 = 0
	Q_主角.属性.体力 = 0
	Q_主角.属性.智力 = 0
	Q_主角.属性.精神 = 0
	
	Q_主角.属性.物理攻击 = 1
	Q_主角.属性.魔法攻击 = 0
	Q_主角.属性.物理防御 = 0
	Q_主角.属性.魔法防御 = 0
	
	


	for n=1,9 do
		if (self.包裹窗口.身体格子[n].道具标识 ~= 0 ) then
			
			Q_主角.属性.物理攻击 = Q_主角.属性.物理攻击 + self.包裹窗口.身体格子[n].道具.物理攻击
			Q_主角.属性.魔法攻击 = Q_主角.属性.魔法攻击 + self.包裹窗口.身体格子[n].道具.魔法攻击
			Q_主角.属性.物理防御 = Q_主角.属性.物理防御 + self.包裹窗口.身体格子[n].道具.物理防御
			Q_主角.属性.魔法防御 = Q_主角.属性.魔法防御 + self.包裹窗口.身体格子[n].道具.魔法防御
			Q_主角.属性.力量 = Q_主角.属性.力量 + self.包裹窗口.身体格子[n].道具.力量
			Q_主角.属性.体力 = Q_主角.属性.体力 + self.包裹窗口.身体格子[n].道具.体力
			Q_主角.属性.智力 = Q_主角.属性.智力 + self.包裹窗口.身体格子[n].道具.智力
			Q_主角.属性.精神 = Q_主角.属性.精神 + self.包裹窗口.身体格子[n].道具.精神
			
			
			
		end
		
		
		
	end
	


	self.状态窗口.面板渲染结束 = false

	


end


--=============================================================================--
-- ■ 增加屏幕物件
--=============================================================================--
function 类_主屏幕:增加屏幕物件(物件)

	物件.物件ID = #self.屏幕物件组 + 1 + 精确小数(引擎:取运行时间(),3) 
	table.insert(self.屏幕物件组,物件)
	
	
end 







--=============================================================================--
-- ■ 鼠标左键按下()
--=============================================================================--

function 类_主屏幕:鼠标左键按下()

	if(self.窗口id ~= 0 )then                       
		
		for n=1, table.getn(self.界面_窗口_数组) do
			self.界面_窗口_数组[n]:置焦点(false)
		end
		
		self.界面_窗口_数组[self.鼠标窗口全id]:置焦点(true)
		self.界面_窗口_数组[self.鼠标窗口全id]:初始移动()
		
	end
	
	if (Q_游戏数据.鼠标坐标.y < 420  and self.鼠标窗口全id == 0 ) then 
	
		if(Q_游戏数据.最后点击格子 ~= nil and Q_游戏数据.鼠标道具.id ~=0) then
		
			if (Q_游戏数据.最后点击格子.标识 <= 240) then  
				
				Q_系统:掉落物品(Q_游戏数据.鼠标道具.道具,Q_主角.坐标.x,Q_主角.坐标.y,Q_游戏数据.鼠标道具.道具.数量,false)
				
				Q_游戏数据.最后点击格子 = nil
				Q_游戏数据.鼠标道具.id = 0
				
				
			end
		
		end
	end
	
	
	if (Q_游戏数据.鼠标技能.对象 ~= nil and Q_游戏数据.鼠标坐标.y < 420 and self.鼠标窗口全id == 0) then
		
		Q_游戏数据.鼠标技能.对象 = nil

		
	end 
	

	
	
	
	
	
	
	if (Q_菜单.是否显示 and Q_菜单.焦点 == false ) then 
		Q_菜单:关闭()
	end 

	
	
	
	
	
	
	
end




--=============================================================================--
-- ■ 鼠标右键按下()
--=============================================================================--

function 类_主屏幕:鼠标右键按下()
	
	
	if(Q_游戏数据.最后点击格子 ~= nil and Q_游戏数据.鼠标道具.id ~=0) then
	 
		if (Q_游戏数据.最后点击格子.标识 <= 240) then            -- 包裹格子中
			
			if (self.包裹窗口:增加物品(Q_游戏数据.鼠标道具.道具,Q_游戏数据.鼠标道具.道具.数量,false)) then 
				Q_游戏数据.鼠标道具.id = 0
				Q_游戏数据.最后点击格子 = nil
			end 
			
			
		elseif (Q_游戏数据.最后点击格子.标识 >320 and Q_游戏数据.最后点击格子.标识 <= 326) then     
			Q_游戏数据.最后点击格子:置道具(Q_游戏数据.鼠标道具.道具,Q_游戏数据.鼠标道具.道具.数量,true)
			Q_游戏数据.鼠标道具.id = 0
			Q_游戏数据.最后点击格子 = nil
			
			
		end 
	 
	end
	 
	 
	 
	 


end






--=============================================================================--
-- ■ 取当前鼠标所在窗口()
--=============================================================================--

function 类_主屏幕:取鼠标所在窗口(是否全部)
		
	for n=table.getn(self.界面_窗口_数组), 1,-1 do
	
		if (是否全部 ~=nil) then 
			if(self.界面_窗口_数组[n].可视 and self.界面_窗口_数组[n]:检测点_全局()) then
				return n
			 end	
		else 
			if(self.界面_窗口_数组[n].可视 and self.界面_窗口_数组[n]:检测点()) then
				return n
			end	
		end 

		 
	end

        return 0
end




--=============================================================================--
-- ■ 显示快捷格子物品属性
--=============================================================================--
function 类_主屏幕:显示快捷格子物品属性()
	
	if (Q_游戏数据.鼠标坐标.x > 70 and Q_游戏数据.鼠标坐标.x <260 and  Q_游戏数据.鼠标坐标.y > 440) then 
		
		for n=1 ,6 do 
		
			if (self.道具快捷组[n].道具标识 ~= 0 and self.道具快捷组[n].包围盒:检测_点(Q_游戏数据.鼠标坐标.x, Q_游戏数据.鼠标坐标.y) ) then
				

				显示偏移 = - self.道具快捷组[n].风格提示.宽度 /2
				
				
				显示偏移Y = self.道具快捷组[n].y-self.道具快捷组[n].风格提示.高度 -20
				
			
				显示风格提示(self.道具快捷组[n].x + 显示偏移,显示偏移Y,
								self.道具快捷组[n].风格提示.风格文字组, 
								self.道具快捷组[n].风格提示.宽度, 
								self.道具快捷组[n].风格提示.高度,220,1,2,1,self.道具快捷组[n].道具) 
				
				
				return 
			end
			
		end
		
		
		
		
	elseif (Q_游戏数据.鼠标坐标.x > 370  and  Q_游戏数据.鼠标坐标.y > 440) then 
		
		for n=1 ,6 do 
		
			if (self.技能快捷组[n].技能 ~= nil and self.技能快捷组[n].包围盒:检测_点(Q_游戏数据.鼠标坐标.x, Q_游戏数据.鼠标坐标.y) ) then
				

				显示偏移 = - self.技能快捷组[n].风格提示.宽度 /2
				
				
				显示偏移Y = self.技能快捷组[n].坐标.y-self.技能快捷组[n].风格提示.高度 -20
				
			
				显示风格提示(self.技能快捷组[n].坐标.x + 显示偏移,显示偏移Y,
								self.技能快捷组[n].风格提示.风格文字组, 
								self.技能快捷组[n].风格提示.宽度, 
								self.技能快捷组[n].风格提示.高度,220,1,3) 
				
				
				return 
			end
			
		end
		
		
		
		
	end
	
	
	
	
	
	
	

end



--=============================================================================--
-- ■ 键盘快捷键逻辑
--=============================================================================--
function 类_主屏幕:键盘快捷键逻辑()
	
	if (引擎:取按键按下(Q_游戏数据.按键配置["包裹窗口"])) then -- 包裹快捷键
		self.包裹窗口:开关()
	end
	
	if (引擎:取按键按下(Q_游戏数据.按键配置["状态窗口"])) then -- 包裹快捷键
		self.状态窗口:开关()
	end
	
	if (引擎:取按键按下(Q_游戏数据.按键配置["技能窗口"])) then -- 包裹快捷键
		self.技能窗口:开关()
	end

	if (引擎:取按键按下(键_1)) then 	
		self:快捷道具使用(1)
	end 
	
	if (引擎:取按键按下(键_2)) then 
		self:快捷道具使用(2)
	end 
	
	if (引擎:取按键按下(键_3)) then 
		self:快捷道具使用(3)		
	end 
	
	if (引擎:取按键按下(键_4)) then 
		self:快捷道具使用(4)	
	end 	
	
	if (引擎:取按键按下(键_5)) then 
		self:快捷道具使用(5)	
	end 
	
	if (引擎:取按键按下(键_6)) then 
		self:快捷道具使用(6)	
	end 
	
	
	if (引擎:取按键按下(键_A)) then 
		if (self.技能快捷组[1].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[1].技能.名称)
		end
		
	elseif (引擎:取按键按下(键_S)) then 
		if (self.技能快捷组[2].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[2].技能.名称)
		end
		
	elseif (引擎:取按键按下(键_D)) then 
		if (self.技能快捷组[3].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[3].技能.名称)
		end
		
	elseif (引擎:取按键按下(键_F)) then 
		if (self.技能快捷组[4].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[4].技能.名称)
		end
		
	elseif (引擎:取按键按下(键_G)) then 
		if (self.技能快捷组[5].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[5].技能.名称)
		end
		
	elseif (引擎:取按键按下(键_H)) then 
		if (self.技能快捷组[6].技能 ~= nil ) then 
			Q_主角:寻找发动技能(self.技能快捷组[6].技能.名称)
		end
		
	end 
	
	
	
	
	
	

	
	
	
	
end

--=============================================================================--
-- ■ 快捷道具使用
--=============================================================================--
function 类_主屏幕:快捷道具使用(ID)


	if (self.道具快捷组[ID].道具标识 ~= 0) then -- 有道具的时候
		local 本次物品ID = self.道具快捷组[ID].道具标识
		self.道具快捷组[ID]:鼠标右键单击逻辑()
--		if (self.道具快捷组[ID].道具标识 == 0) then -- 道具已经消失 需要补全
--			自动从包裹中加入物品(本次物品ID,self.道具快捷组[ID])  
--		end 
	end 


end





--=============================================================================--
-- ■ 渲染区恢复
--=============================================================================--
function 类_主屏幕:渲染区恢复()


	
	self.聊天显示框.显示框渲染精灵:置图片(引擎:取渲染区纹理(self.聊天显示框.显示框渲染区)) 
	self.状态窗口.面板渲染区精灵:置图片(引擎:取渲染区纹理(self.状态窗口.面板渲染区))



	
end 