--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- ★ Game特效类	
--=============================================================================--
特效类  = class()

--=============================================================================--
-- ■ 构造函数
--=============================================================================--

function 特效类:初始化(特效名称,特效类型,x坐标,y坐标,显示w,显示h,弧度,显示次数)	-- 显示次数为0 则标识该特效无限循环
	

	
	self.标识类型 = "屏幕特效"
	
	self.特效名称 =  特效名称
	self.类型 = 特效类型
	
	
	self.特效动画 =  类_新PAK类.创建("Dat/pak/effect/" ..  Q_游戏数据.特效配置组[特效名称].资源包,  Q_游戏数据.特效配置组[特效名称].开始帧,true)
	self.特效动画:置中心点 (Q_游戏数据.特效配置组[特效名称].中心点x,Q_游戏数据.特效配置组[特效名称].中心点y)
	
	self.中心点偏移 = {x = Q_游戏数据.特效配置组[特效名称].中心点x,y = Q_游戏数据.特效配置组[特效名称].中心点y}
	self.参照点偏移 = {x = Q_游戏数据.特效配置组[特效名称].参照点偏移x,y = Q_游戏数据.特效配置组[特效名称].参照点偏移y }
	
	
	
	self.方向 = 1
	self.w = 显示w
	self.h = 显示h
	self.弧度 = 弧度
	if (self.弧度 == nil) then 
		self.弧度 = 0
	end 
	
	
	self.坐标 = {x=x坐标,y=y坐标}
	self.参照点 = {x=x坐标,y=y坐标}
	
	
	
	if (Q_游戏数据.特效配置组[特效名称].混合 == 1) then  
		self.特效动画 :置混合 (混合_颜色乘)
		
	end 
--	self.特效动画.包围盒显示 = true  
	

	self.排序参照点 = self.坐标.y + self.参照点偏移.y

	
	if ( Q_游戏数据.特效配置组[特效名称].颜色值 ~= "0" ) then 
							
		local  颜色分割 = 分割文本(Q_游戏数据.特效配置组[特效名称].颜色值, "|")	
		
		if (table.getn(颜色分割) == 4 ) then
		
			local 颜色值 = {
				A = tonumber( 颜色分割[1] ),	
				R = tonumber( 颜色分割[2] ),	
				G = tonumber( 颜色分割[3] ),	
				B = tonumber( 颜色分割[4] )
			}
			
			self.特效动画 :置颜色(ARGB(颜色值.A,颜色值.R,颜色值.G,颜色值.B))
			
			
		end 

	end 
	
	

	self.已经消失 = false

	self.显示次数 = 显示次数
	self.当前显示次数  = 0	
	
	self.累积判断 = false

	self.开始索引 = Q_游戏数据.特效配置组[特效名称].开始帧
	self.结束索引 = Q_游戏数据.特效配置组[特效名称].结束帧
	
	self.帧速 = Q_游戏数据.特效配置组[特效名称].帧率
	
	
	
	self.上一帧动画 = 0
	
	
end




--=============================================================================--
-- ■ 更新
--=============================================================================--

function 特效类:更新()	


	if (self.可视 == false ) then
		return false
	end
	
	
	
	self.上一帧动画 = self.特效动画:取间隔帧()
	

	if (self.开始索引 ~= 0) then
		if (self.往返更新) then 
			self.特效动画:往返更新(self.帧速,self.开始索引,self.结束索引)
		else
			self.特效动画:更新(self.帧速,self.开始索引,self.结束索引)
		end
	else
		if (self.往返更新) then 
			self.特效动画:往返更新(self.帧速)
		else
			self.特效动画:更新(self.帧速)
		end 
	end
	
	

	
	
	
	
	
	if (self.显示次数 ~= 0) then  -- 有播放限制次数

		if( self.特效动画.当前帧 == self.特效动画.结束帧) then
		
			if (self.累积判断 == false) then
				self.当前显示次数 = self.当前显示次数 + 1
				
				
				self.累积判断 = true
			end

		else
			self.累积判断 = false
		end

		
		if (self.当前显示次数 >= self.显示次数) then
			self.已经消失 = true
		end
		
	end





	

--	if ( self.时间 >0 ) then 
--		self.显示时间计次  = self.显示时间计次  + dt 
--		
--		if (self.显示时间计次  >= self.时间) then 
--			self.已经消失 = true
--			
--			
--		end 
--		
--		
--		
--	end 



end




--=============================================================================--
-- ■ 显示
--=============================================================================--

function 特效类:显示()	

	
	if (self.已经消失 == false ) then 
		
		if ( self.类型 == "屏幕坐标" ) then 
			self.特效动画:显示(self.坐标.x ,self.坐标.y ,self.方向 * self.w ,self.h,self.弧度)
			
			
		elseif (self.类型 == "跟随主角") then
		
			self.特效动画:显示(Q_主角.坐标.x  + Q_游戏数据.画面偏移.x ,Q_主角.坐标.y - 50  + Q_游戏数据.画面偏移.y,self.w ,self.h,self.弧度)
			
		else
			self.特效动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y + Q_游戏数据.画面偏移.y,self.方向 * self.w ,self.h,self.弧度)
		end 
		
	end 


	if (Q_调试) then 
		引擎:画圆(self.坐标.x  + Q_游戏数据.画面偏移.x,self.排序参照点, 5,50,颜色_黄)
	end 

	
end


--=============================================================================--
-- ■ 置位置
--=============================================================================--

function 特效类:置位置(x,y)	

	self.坐标.x = x
	self.坐标.y = y

end




--=============================================================================--
-- ■ 销毁
--=============================================================================--

function 特效类:销毁()

	self.特效动画:销毁()

end 