--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年4月15日17时13分26秒
--=============================================================================--

类_怪物_普通类  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_怪物_普通类:初始化(坐标x,坐标y,怪物对象)

	self.对象 = 怪物对象
	self.标识类型 = "怪物_普通"
	self.标识 = self.对象.标识
	self.已经死亡 = false
	self.已经消失 = false
	self.纸娃娃组 = {}
	self.模型大小 = 1
	self.状态 = "停止"
	self.方向 = 1  -- 右
	self.坐标 = {x=坐标x,y=坐标y}
	self.上次坐标 = {x=坐标x,y=坐标y}
	self.移动目标点 = {x=坐标x,y=坐标y}
	self.排序参照点 = 坐标y
	self.跳跃偏移 = 0
	self.动作暂停 = false
	self.可移动 = true
	self.跳跃中 = false
	self.攻击中 = false
	self.可攻击 = true
	self.跳跃影子 = false
	self.移动中 = false
	self.跳跃攻击次数 = 0
	self.跳跃攻击 = false
	self.跳跃攻击最后 = false 
	self.弹跳力 = 0
	self.跳跃行为 = {类别="",前置动作=""}
	self.掉血特效组 = {}
	self.上一帧动画 = 0
	self.击退力量 = 0
	self.击退速度 = 0
	self.击退方向 = 0
	
	self.暂停计次 = 0
	self.暂停更新 = 0
	
	self.本次击中目标 = false
	
	self.上次被攻击 = {
		时间 = 0,
		来源 = nil,
		参考 = ""
	}
	
	
	
	
	if (self.标识 == "哥布林") then
		
		self.动作信息 = {
				停止 = 	{帧率 = 30,	起始帧 = 1,	结束帧 = 1,计次 = 0 ,延时 = 0.3  },
				行走 = 	{帧率 = 20,	起始帧 = 12,	结束帧 = 17,计次 = 0 ,延时 = 0.3 },
				攻击A = {帧率 = 20,	起始帧 = 2,		结束帧 = 5 ,计次 = 0 ,延时 = 0.3 },
				被击中1 = {帧率 = 20,	起始帧 = 6,		结束帧 = 6,计次 = 0 ,延时 = 0.3 },
				被击中2 = {帧率 = 20,	起始帧 = 7,		结束帧 = 7,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_起 = {帧率 = 20,	起始帧 = 7,		结束帧 = 7,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_落 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_反弹起 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				空中被击中1 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				空中被击中2 = {帧率 = 20,	起始帧 = 9,		结束帧 = 9,计次 = 0 ,延时 = 0.3 },
				倒地 = {帧率 = 20,	起始帧 = 10,		结束帧 = 10,计次 = 0 ,延时 = 0.3 },
				起身 = {帧率 = 20,	起始帧 = 11,		结束帧 = 11,计次 = 0 ,延时 = 0.3 }
		}
		
		self.动作音效组 = {
			被攻击喊叫 = {
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_01.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_02.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_03.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_04.wav")
			},
			武器攻击音效 = {
				D2D_音效.创建("Dat/sound/monster/gbn_thw.wav")
			},
			武器击中音效 = {
				Q_游戏数据.音效组.普通击中
			},
			死亡喊叫音效  = {
				D2D_音效.创建("Dat/sound/monster/gbn_die_01.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_die_02.wav")
			},
		}
		
		
		self.纸娃娃组[1] = { 位置 = "身体",动画 = 类_新PAK类.创建("Dat/pak/monster/哥布林.pak",1,true)}
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:置中心点(100,155) 
		end
		
		self.参照动画 = self.纸娃娃组[1].动画
		


		
		
	elseif (self.标识  == "投掷哥布林") then
		
		
		self.动作信息 = {
				停止 = 	{帧率 = 30,	起始帧 = 1,	结束帧 = 1,计次 = 0 ,延时 = 0.3  },
				行走 = 	{帧率 = 20,	起始帧 = 12,	结束帧 = 17,计次 = 0 ,延时 = 0.3 },
				攻击A = {帧率 = 20,	起始帧 = 2,		结束帧 = 5 ,计次 = 0 ,延时 = 0.3 },
				被击中1 = {帧率 = 20,	起始帧 = 6,		结束帧 = 6,计次 = 0 ,延时 = 0.3 },
				被击中2 = {帧率 = 20,	起始帧 = 7,		结束帧 = 7,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_起 = {帧率 = 20,	起始帧 = 7,		结束帧 = 7,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_落 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_反弹起 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				空中被击中1 = {帧率 = 20,	起始帧 = 8,		结束帧 = 8,计次 = 0 ,延时 = 0.3 },
				
				空中被击中2 = {帧率 = 20,	起始帧 = 9,		结束帧 = 9,计次 = 0 ,延时 = 0.3 },
				倒地 = {帧率 = 20,	起始帧 = 10,		结束帧 = 10,计次 = 0 ,延时 = 0.3 },
				起身 = {帧率 = 20,	起始帧 = 11,		结束帧 = 11,计次 = 0 ,延时 = 0.3 }
		}
		
		self.动作音效组 = {
			被攻击喊叫 = {
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_01.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_02.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_03.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_dmg_04.wav")
			},
			武器攻击音效 = {
				D2D_音效.创建("Dat/sound/monster/gbn_thw.wav")
			},
			武器击中音效 = {
				Q_游戏数据.音效组.普通击中
			},
			死亡喊叫音效  = {
				D2D_音效.创建("Dat/sound/monster/gbn_die_01.wav"),
				D2D_音效.创建("Dat/sound/monster/gbn_die_02.wav")
			},
			
		}
		
		self.纸娃娃组[1] = { 位置 = "身体",动画 = 类_新PAK类.创建("Dat/pak/monster/投掷哥布林.pak",1,true)}
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:置中心点(100,155) 
		end
		
		self.参照动画 = self.纸娃娃组[1].动画
		
		
		
		
	elseif (self.标识  == "牛头怪") then
		
		
		self.动作信息 = {
				停止 = 	{帧率 = 30,	起始帧 = 1,	结束帧 = 1,计次 = 0 ,延时 = 0.3  },
				行走 = 	{帧率 = 20,	起始帧 = 22,	结束帧 = 28,计次 = 0 ,延时 = 0.3 },
				攻击A = {帧率 = 14,	起始帧 = 1,		结束帧 = 8 ,计次 = 0 ,延时 = 0.3 },
				
				被击中1 = {帧率 = 20,	起始帧 = 9,		结束帧 = 9,计次 = 0 ,延时 = 0.3 },
				被击中2 = {帧率 = 20,	起始帧 = 10,		结束帧 = 10,计次 = 0 ,延时 = 0.3 },
				
				被攻击_空中_起 = {帧率 = 20,	起始帧 = 10,		结束帧 = 10,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_落 = {帧率 = 20,	起始帧 = 11,		结束帧 = 11,计次 = 0 ,延时 = 0.3 },
				被攻击_空中_反弹起 = {帧率 = 20,	起始帧 = 11,		结束帧 = 11,计次 = 0 ,延时 = 0.3 },
				空中被击中1 = {帧率 = 20,	起始帧 = 11,		结束帧 = 11,计次 = 0 ,延时 = 0.3 },
				空中被击中2 = {帧率 = 20,	起始帧 = 12,		结束帧 = 12,计次 = 0 ,延时 = 0.3 },
				
				倒地 = {帧率 = 20,	起始帧 = 13,		结束帧 = 13,计次 = 0 ,延时 = 0.3 },
				起身 = {帧率 = 20,	起始帧 = 20,		结束帧 = 20,计次 = 0 ,延时 = 0.3 }
		}
		
		self.动作音效组 = {
			被攻击喊叫 = {
				D2D_音效.创建("Dat/sound/monster/tau_dmg_01.wav"),
				D2D_音效.创建("Dat/sound/monster/tau_dmg_02.wav"),
				D2D_音效.创建("Dat/sound/monster/tau_dmg_03.wav")
			},
			武器攻击音效 = {
				D2D_音效.创建("Dat/sound/monster/gbn_thw.wav")
			},
			武器击中音效 = {
				Q_游戏数据.音效组.普通击中
			},
			死亡喊叫音效  = {
				D2D_音效.创建("Dat/sound/monster/tau_die.wav")
			},
			武器举起音效 = {
				D2D_音效.创建("Dat/sound/monster/tau_axeSwing.wav")
			},
			
			
		}
		
		self.纸娃娃组[1] = { 位置 = "身体",动画 = 类_新PAK类.创建("Dat/pak/monster/牛头怪.pak",1,true)}
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:置中心点(220,330) 
		end
		
		self.参照动画 = self.纸娃娃组[1].动画
		
		
		self.模型大小 = 0.8
		
	end
	
	

	self.属性 = 
	{
		hp = self.对象.HP,
		maxhp = self.对象.HP,
		物理攻击 = self.对象.物攻,
		魔法攻击 = self.对象.魔攻,
		物理防御 = self.对象.物防,
		魔法防御 = self.对象.魔防,
		重量 = self.对象.重量,
		被击硬直时间 = 0.2,
		被击硬直计次 = 0,
		被击弹跳力 = 0,
		被击力量 = 0,
		反弹 = false,
		反弹力 = 0,
		开始反弹 = false,
		落地时间计次 = 0,
		死亡时间计次 = 0,
		刷新时间计次 = 0,
		刷新时间 = 3,
		速度 = self.对象.移动速度 ,
		AI_移动间隔 = self.对象.移动间隔 ,
		AI_移动计次 = 0,
		攻击时间计次 = 0,
		攻击时间间隔 = 2,
		换方向计次 = 0,
		Y攻击范围 = self.对象.Y攻击范围,
		X攻击范围 = self.对象.X攻击范围,
		碎片大小 = self.对象.碎片大小
	
	}
	
	self.掉宝物品组 = {}
	
	if (self.对象.掉宝配置 ~= nil) then 
		self.掉宝物品组 = 取怪物掉宝(self.标识,self.对象.掉宝配置)
	end
	

	

	
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_怪物_普通类:更新()

	self.上一帧动画 = self.参照动画:取间隔帧()

	self.上次坐标.x =  self.坐标.x 
	self.上次坐标.y =  self.坐标.y
	
	self.移动中 = false
	
	
	if (引擎:取按键按下(键_空格)) then
		--self:被打飞(6,2,true,false)
	end
	
	
	self.排序参照点 = self.坐标.y
	
	
	if (self.动作暂停) then
		
		self.动作信息[self.状态].计次 = self.动作信息[self.状态].计次 + dt
		if (self.动作信息[self.状态].计次 >=  self.动作信息[self.状态].延时) then
			
			
			self.动作信息[self.状态].计次 = 0
			self.动作暂停 = false 
			
			if (self.动作信息[self.状态].下连激活) then
				self.动作信息[self.状态].下连激活 = false
				
				self:改变动作(self.动作信息[self.状态].下连动作)
				
				self:播放喊叫音效()
			else
				self:停止()		
				
			end
			
			
		end
		
	else
		
		
		if (self.暂停更新 == 0) then
			self:动作更新()
		else 
			self.暂停更新 = self.暂停更新 - dt
			if (self.暂停更新 <=0) then
				self.暂停更新 = 0
			end
			
			
		end
		
		
	end
	
	
	
	
	
	
	if (self.已经死亡) then
--		
--		self.属性.刷新时间计次 = self.属性.刷新时间计次 + dt
--		
--		if (self.属性.刷新时间计次 >= self.属性.刷新时间) then
--			self:重刷新()
--		end
		
	else
		
		
		if ( self.击退力量 > 0) then 
			self.击退力量 = self.击退力量 - self.击退速度
			self:X方向位移(self.击退力量 * self.击退方向 )
		end 
		
		
		self:被攻击打飞逻辑 ()
		self:倒地逻辑()
		self:被击中逻辑()
		
		self:AI逻辑()
		
		
		
		
		
		if (self.状态 == "行走") then
			self.移动中 = true
		end
		
		
		if (self.状态 ~= "倒地" and not self:是否在被攻击状态() and not self:是否在攻击状态()) then
--			self.属性.换方向计次 = self.属性.换方向计次 + dt
--			if (self.属性.换方向计次 > 1) then
				if (Q_主角.坐标.x > self.坐标.x) then
					self.方向 = 1
				elseif (Q_主角.坐标.x < self.坐标.x) then
					self.方向 = -1
				end
			--	self.属性.换方向计次 = 0
		--	end
			
		end
	

		if (self.上次坐标.x ~= self.坐标.x or self.上次坐标.y ~= self.坐标.y) then 
			
			for n=1 , #Q_地图.矩形_障碍层  do
				
				if(Q_地图.矩形_障碍层[n].包围盒:检测_点(self.坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y ) ) then -- 接触到包围盒
					
						if (self.上次坐标.y ~= self.坐标.y) then
							
							if(Q_地图.矩形_障碍层[n].类型==1 and Q_地图.矩形_障碍层[n].包围盒:检测_点(self.坐标.x + self.属性.速度  * self.方向 + Q_游戏数据.画面偏移.x,self.上次坐标.y ) == false) then -- 接触到包围盒
							--	self.坐标.x = self.坐标.x + self.属性.速度  * self.方向
								self.坐标.y = self.上次坐标.y 
								self.移动目标点.y = self.坐标.y
								
								
								if (self.移动中) then
									
									local 包围盒参照 = Q_地图.矩形_障碍层[n].包围盒:取顶点x () + Q_地图.矩形_障碍层[n].包围盒:取宽度 () / 2
									
									
									if (Q_地图:是否可行(self.坐标.x + self.属性.速度 * self.方向 ,self.坐标.y )) then
										if (self.坐标.x + Q_游戏数据.画面偏移.x > 包围盒参照 ) then
											self.坐标.x = self.坐标.x + self.属性.速度
											self.移动目标点.x = self.坐标.x + self.属性.速度 
										else
											self.坐标.x = self.坐标.x - self.属性.速度
											self.移动目标点.x = self.坐标.x -self.属性.速度 
										end
									else
										self.坐标.y = self.上次坐标.y 
										self.坐标.x = self.上次坐标.x
										self:停止()
									end
									
									
									
								end
								
		
								
							else
								self.坐标.y = self.上次坐标.y 
								self.坐标.x = self.上次坐标.x
								self:停止()
								
								
							end
							
							return 
						end
						
						
						if (self.上次坐标.x ~= self.坐标.x) then
							
							if(Q_地图.矩形_障碍层[n].类型==1 and Q_地图.矩形_障碍层[n].包围盒:检测_点(self.上次坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y+ self.属性.速度   ) == false) then -- 接触到包围盒
							--	self.坐标.y = self.上次坐标.y  + self.属性.速度 
								
								
								self.坐标.x = self.上次坐标.x
								--self.移动目标点.x = self.坐标.x
								
								
								if (self.移动中) then
									local 包围盒参照 = Q_地图.矩形_障碍层[n].包围盒:取顶点y () + Q_地图.矩形_障碍层[n].包围盒:取高度 () / 2
									
									
									if ( self.坐标.y  < 包围盒参照) then
										
										
										if (Q_地图:是否可行(self.坐标.x,self.坐标.y - self.属性.速度 )) then
											self.坐标.y = self.坐标.y - self.属性.速度 
											self.移动目标点.y = self.坐标.y - self.属性.速度 
										else
											self.坐标.y = self.上次坐标.y 
											self.坐标.x = self.上次坐标.x
											self:停止()
										end
										
										
									elseif (self.坐标.y  >= 包围盒参照) then
										
										if (Q_地图:是否可行(self.坐标.x,self.坐标.y + self.属性.速度 )) then
											self.坐标.y = self.坐标.y + self.属性.速度 
											self.移动目标点.y = self.坐标.y + self.属性.速度 
										else
											self.坐标.y = self.上次坐标.y 
											self.坐标.x = self.上次坐标.x
											self:停止()
										end
										
										
										
										
									end 
									
									
										
									
								end
								
							
								
							else
								self.坐标.y = self.上次坐标.y 
								self.坐标.x = self.上次坐标.x
							
								self:停止()
							end
							
							return
						end
					
					
					
					break
				end
				
				
			end
				
--		
--			if (Q_地图:是否可行(self.坐标.x ,self.坐标.y ) == false) then
--				self.坐标.x = self.上次坐标.x
--				self.坐标.y = self.上次坐标.y 
--				self:停止()
--			end
			
			
			
		end
		

		
		
		
		
	end
	
	
--	self.地平线 = self.坐标.y 
	
	
	
	
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_怪物_普通类:显示()

	if ( self.已经消失  or  ( math.abs(Q_主角.坐标.x -  self.坐标.x  ) > Q_游戏数据.屏幕宽度 + 200) ) then 
		return 
	end 

	if (self.已经死亡 and self.已经消失 == false) then

		
		self:PAK动画置颜色(颜色_白)
		self:PAK动画置混合(混合_单色)
		
		self.属性.死亡时间计次 = self.属性.死亡时间计次 + dt 

		if (self.属性.死亡时间计次 > 0.3) then
			self.已经消失 = true
		end

	end


	self.参照动画.影子可视 = true
	self.参照动画.影子y偏移 = __ED_精灵_取高度(self.参照动画.碎图片精灵)*0.6 * self.模型大小
	self.参照动画.影子透明度 = 100
	
	
-- 跳跃时 动态的改变影子效果 
	
	if (self.跳跃影子) then
		self.参照动画.影子_跳跃偏移.x = 0
		self.参照动画.影子_跳跃偏移.y =   -(self.跳跃偏移 + self.弹跳力 *3 -5 )
	else
		self.参照动画.影子_跳跃偏移.x = 0
		self.参照动画.影子_跳跃偏移.y = 0
	end
	
	
	for n=1,#self.纸娃娃组 do
		self.纸娃娃组[n].动画:显示( self.坐标.x  + Q_游戏数据.画面偏移.x,  self.坐标.y  + self.跳跃偏移 + Q_游戏数据.画面偏移.y,self.模型大小*self.方向,self.模型大小)
	end
	
	
	self:掉血动画显示()
	
	
	
	
	if (Q_调试) then 
		self.纸娃娃组[1].动画.包围盒显示 = true
		引擎:画圆(self.坐标.x  + Q_游戏数据.画面偏移.x ,self.坐标.y, 5,50,颜色_黄)
		
		文字:显示(self.坐标.x  + Q_游戏数据.画面偏移.x -20 ,self.坐标.y -90,string.format("%d,%d",self.移动目标点.x,self.移动目标点.y))
		
		
	else
		self.纸娃娃组[1].动画.包围盒显示 = false
	end

end




--=============================================================================--
-- ■ AI逻辑
--=============================================================================--

function 类_怪物_普通类:AI逻辑()	
	
	
	self.属性.攻击时间计次 = self.属性.攻击时间计次 + dt
	if (self.属性.攻击时间计次 >= self.属性.攻击时间间隔) then
		
		if (self.可攻击 and 
			not Q_主角.已经死亡 and  
			not self:是否在攻击状态() and
			math.abs(self.坐标.y-Q_主角.坐标.y) <=  self.属性.Y攻击范围 and 
			math.abs(self.坐标.x-Q_主角.坐标.x) <=  self.属性.X攻击范围  ) then 
			
			
			self:改变动作("攻击A" )
			self.本次击中目标 = false
			
			
		end 
		
		self.属性.攻击时间计次  = 0
		
	end
	

	

	if (self.状态 == "停止") then
	
		self.属性.AI_移动计次 = self.属性.AI_移动计次 + dt
		if (self.属性.AI_移动计次 >= self.属性.AI_移动间隔) then
			
			if ( math.abs(Q_主角.坐标.x - self.坐标.x) <=400) then
				self:移动到( Q_主角.坐标.x + 引擎:取随机整数(-200,200), Q_主角.坐标.y+ 引擎:取随机整数(-20,20))
			else
				self:移动到( self.坐标.x + 引擎:取随机整数(-100,100), self.坐标.y+ 引擎:取随机整数(-20,20))
			end
			
			self.属性.AI_移动间隔 = 引擎:取随机整数(0.7,1.3)
			if (self.属性.AI_移动间隔 < 0.5) then
				self.属性.AI_移动间隔 = 1
			end
			self.属性.AI_移动计次 = 0
		end
		
	elseif (self.状态 == "攻击A") then

		if (self.标识 == "哥布林") then
			if (self.上一帧动画 == 1 and self.参照动画:取间隔帧() == 2) then
				self.动作音效组.武器攻击音效[1]:播放()
			elseif (self.参照动画:取间隔帧() == 3) then -- 最后帧
				self.动作暂停 = true
				
			end 
		
			if (not self.本次击中目标  and self.上一帧动画 > 1 ) then
				local 是否击中 = false
				
				if  (math.abs(self.坐标.y-Q_主角.坐标.y) <=  self.属性.Y攻击范围 and math.abs(self.坐标.x-Q_主角.坐标.x) <=  self.属性.X攻击范围  ) then 
					是否击中 = __包围盒碰撞检测(self.参照动画.动画包围盒,Q_主角.参照动画.动画包围盒)
					
					
					if (是否击中) then
						Q_主角:被击中(nil,self:伤害计算(0,Q_主角))
						self.动作音效组.武器击中音效[1]:播放()
						Q_系统:增加屏幕特效("打击" .. 引擎:取随机整数(1,3), "地图坐标",self.坐标.x + self.方向 * 20,self.坐标.y - 50,-self.方向 * 0.6,0.6,0,1)
						
						self.本次击中目标  = true
					end
					
				end
				
			end
		
		
		elseif (self.标识 == "投掷哥布林") then
		
			if (self.上一帧动画 == 1 and self.参照动画:取间隔帧() == 2) then
				self.动作音效组.武器攻击音效[1]:播放()
			elseif (self.参照动画:取间隔帧() == 3) then -- 最后帧
				self.动作暂停 = true
			end 
			
			if (self.上一帧动画 == 1 and self.参照动画:取间隔帧() == 2) then
				Q_系统:发射子弹(self.坐标.x + self.方向 * 15,self.坐标.y - 50,0,300,300,"哥布林石块",self.方向,self.坐标.y,self,"主角")
			end
			
			
			
		elseif (self.标识 == "牛头怪") then
				
			if (self.上一帧动画 == 1 and self.参照动画:取间隔帧() == 2) then
				self.暂停更新 = 0.4
				self.动作音效组.武器举起音效[1]:播放()
			elseif (self.上一帧动画 == 2 and self.参照动画:取间隔帧() == 3) then
				self.动作音效组.武器攻击音效[1]:播放()
			elseif (self.参照动画:取间隔帧() == 7) then -- 最后帧
				self.动作暂停 = true
			end 
			
			
			
			
			if (not self.本次击中目标  and self.上一帧动画 > 2   and self.上一帧动画 < 7 ) then
				local 是否击中 = false
				
				
				if  (math.abs(self.坐标.y-Q_主角.坐标.y) <=  self.属性.Y攻击范围 and math.abs(self.坐标.x-Q_主角.坐标.x) <=  self.属性.X攻击范围  ) then 
				
					if ((self.方向==1 and Q_主角.坐标.x >= self.坐标.x)  or (self.方向==-1 and Q_主角.坐标.x <= self.坐标.x)) then
						是否击中 = __包围盒碰撞检测(self.参照动画.动画包围盒,Q_主角.参照动画.动画包围盒)
					end
					
					if (是否击中) then
						Q_主角:被击中(nil,self:伤害计算(0,Q_主角))
						Q_主角:被击退(8,2,self.方向)	
						self.动作音效组.武器击中音效[1]:播放()
						Q_系统:增加屏幕特效("打击" .. 引擎:取随机整数(1,3), "地图坐标",Q_主角.坐标.x ,self.坐标.y - 50+Q_主角.跳跃偏移,-self.方向 * 0.8,0.8,0,1)
						
						self.本次击中目标  = true
					end
					
				end
				
				
			end
			
			
		end
		
		
		
		
		
		
	end
	
	
	
	if (math.abs( self.移动目标点.x - self.坐标.x) > self.属性.速度 or math.abs(self.移动目标点.y - self.坐标.y) > self.属性.速度) then
		
		if (self:是否在被攻击状态() == false and self.状态 ~= "倒地" and self:是否在攻击状态() == false) then
			self:移动逻辑()
		end 
	
	else 
		if (self:是否在被攻击状态() == false and self.状态 ~= "倒地" and self:是否在攻击状态() == false) then
			self:改变动作("停止",true )
		end 
	end
	

	



--	self.属性.速度
--	
--	self.本次移动.X距离 = 
--	方向




	
	
end






--=============================================================================--
-- ■ 移动逻辑
--=============================================================================--
function 类_怪物_普通类:移动逻辑()


	if (self:是否在被攻击状态()) then
		return 
	end
	
	
	
--		
--		if (math.abs(self.移动目标点.x  - self.坐标.x)> self.属性.速度 ) then 
--			
--			if ( self.移动目标点.x > self.坐标.x) then 
--				self:改变动作("行走",true)
--				self.坐标.x = self.坐标.x + self.属性.速度 
--				
--			elseif ( self.移动目标点.x < self.坐标.x) then  
--				self:改变动作("行走",true)
--				self.坐标.x = self.坐标.x - self.属性.速度 
--			end 
--			
--		end 
--	
--		
--		if (math.abs(self.移动目标点.y  - self.坐标.y) > self.属性.速度) then 
--		
--		
--			if ( self.移动目标点.y  > self.坐标.y ) then 
--				self:改变动作("行走",true)
--				self.坐标.y = self.坐标.y + self.属性.速度 
--				
--			elseif ( self.移动目标点.y  < self.坐标.y ) then 
--				self:改变动作("行走",true)
--				self.坐标.y = self.坐标.y - self.属性.速度 
--			end 
--		
--		end 
--	

		
		if (math.abs(self.移动目标点.x  - self.坐标.x)> self.属性.速度 ) then 
			
			if ( self.移动目标点.x > self.坐标.x) then 
				self:改变动作("行走",true)
				self.坐标.x = self.坐标.x + self.属性.速度 
				
			elseif ( self.移动目标点.x < self.坐标.x) then  
				self:改变动作("行走",true)
				self.坐标.x = self.坐标.x - self.属性.速度 
			end 
			
			return
			
		end 
		
		if (math.abs(self.移动目标点.y  - self.坐标.y) > self.属性.速度) then 
		
		
			if ( self.移动目标点.y  > self.坐标.y ) then 
				self:改变动作("行走",true)
				self.坐标.y = self.坐标.y + self.属性.速度 
				
			elseif ( self.移动目标点.y  < self.坐标.y ) then 
				self:改变动作("行走",true)
				self.坐标.y = self.坐标.y - self.属性.速度 
			end 
		
		end 

		

	




end 










--=============================================================================--
-- ■ 移动到
--=============================================================================--
function 类_怪物_普通类:移动到(x,y)

--	if (Q_主角.坐标.x > self.坐标.x) then
--		self.方向 = 1
--	elseif (Q_主角.坐标.x < self.坐标.x) then
--		self.方向 = -1
--	end

	if (self.坐标.x == x and self.坐标.y == y) then
		return
	end
	

		
	if (x > self.坐标.x) then -- 右边走
	
		local x偏移 = x - self.坐标.x
		
		if (Q_地图:是否可行(self.坐标.x + self.属性.速度, self.坐标.y ) ) then  -- 右能走
			
			
		elseif (Q_地图:是否可行(self.坐标.x , self.坐标.y + self.属性.速度 ) ) then  -- 下能走
			x = self.坐标.x
			y = self.坐标.y + 引擎:取随机整数(30,80)
			
		elseif (Q_地图:是否可行(self.坐标.x -  self.属性.速度 , self.坐标.y ) ) then  -- 左能走
			x = self.坐标.x - x偏移
			y = self.坐标.y
			
		elseif (Q_地图:是否可行(self.坐标.x , self.坐标.y  -  self.属性.速度) ) then  -- 上能走
			x = self.坐标.x
			y = self.坐标.y - 引擎:取随机整数(30,80)
			
		end
		
		
	elseif (x < self.坐标.x) then -- 左边走
	
		local x偏移 = self.坐标.x - x
		
		
		if (Q_地图:是否可行(self.坐标.x - self.属性.速度, self.坐标.y ) ) then  -- 左能走
			
			
		elseif (Q_地图:是否可行(self.坐标.x , self.坐标.y + self.属性.速度 ) ) then  -- 下能走
			x = self.坐标.x
			y = self.坐标.y + 引擎:取随机整数(30,80)
			
		elseif (Q_地图:是否可行(self.坐标.x +  self.属性.速度 , self.坐标.y ) ) then  -- 右能走
			x = self.坐标.x + x偏移
			y = self.坐标.y
			
		elseif (Q_地图:是否可行(self.坐标.x , self.坐标.y  -  self.属性.速度) ) then  -- 上能走
			x = self.坐标.x
			y = self.坐标.y - 引擎:取随机整数(30,80)
			
		end
		
		
		
		
	end

	

--	
--	if (y > self.坐标.y) then -- 下边走
--		local y偏移 = y - self.坐标.y
--		if (Q_地图:是否可行(self.坐标.x , self.坐标.y + 1) == false) then  -- 下边不能走
--			y = self.坐标.y - y偏移
--		end
--	end


--	if (y < self.坐标.y) then -- 上边走
--		local y偏移 = self.坐标.y - y
--		if (Q_地图:是否可行(self.坐标.x , self.坐标.y - 1) == false) then  -- 上边不能走
--			y = self.坐标.y + y偏移
--		end
--	end
--	
	
--	if (Q_地图:是否可行(self.坐标.x + self.属性.速度  * self.方向, self.坐标.y) == false ) then  -- 左右不能走
--		x = self.移动目标点.x
--		

--		
--		
--	end
--	


	
	
	self.移动目标点.x =    x		
	self.移动目标点.y =    y
	
	
	
	
	
	
	self:改变动作("行走",true)
	
	
	
	

end 


--=============================================================================--
-- ■ 改变方向
--=============================================================================--

function 类_怪物_普通类:改变方向()	
	

	
	
end


--=============================================================================--
-- ■ X方向位移
--=============================================================================--
function 类_怪物_普通类:X方向位移(位移)

	self.坐标.x = self.坐标.x +位移
	
end 












--=============================================================================--
-- ■ 改变动作
--=============================================================================--
function 类_怪物_普通类:改变动作(动作,唯一)
	
	
	

	
	
	if ( 唯一 ~= nil ) then 
		
		if (self.状态 ~= 动作) then 
			self.状态 = 动作
			
			self:PAK动画重置()
			
			self:动作更新()
		end 
	
	else 

		self.状态 = 动作

		self:PAK动画重置()
		self.上一帧动画 = 0
	
		self:动作更新()
		
	end 
	
	
	
	

end 




--=============================================================================--
-- ■ 重刷新
--=============================================================================--

function 类_怪物_普通类:重刷新()	


	self.掉血特效组 = {}
	self.属性.刷新时间计次 = 0
	self.属性.死亡时间计次 = 0
	self.属性.hp = self.属性.maxhp
	self.击退力量 = 0
	self.属性.被击弹跳力 = 0
	
	self:PAK动画置颜色(颜色_白)
	self:PAK动画置混合(混合_默认)
	self:改变动作("停止")

	
	
	self.已经消失 =  false
	self.已经死亡 =  false

end



--=============================================================================--
-- ■ 被击中
--=============================================================================--

function 类_怪物_普通类:被击中(来源,掉血值,基础掉血值)	
	
	self.上次被攻击.来源 = 来源
	
--	if (self.上次被攻击.来源 == 来源 and self.上次被攻击.参考 == 参考) then
--		return false
--	else
--		self.上次被攻击.来源 = 来源
--		self.上次被攻击.参考 = 参考
--		self.上次被攻击.时间 = 引擎:取运行时间()
--	end

	self.暂停更新 = 0

	if (self.跳跃偏移 ~=0) then
		if (self.属性.被击弹跳力 ~=0) then
			self.空中被击动作 = 引擎:取随机整数(1,2)
			self:被打飞(4 ,2,true,false)
			
		else
			self:被打飞(6 ,3,true,false)
		end
		
		
	elseif (self.状态 == "倒地") then
		
		self:被打飞(3,2 ,false,false)
		
	else
		
		self:改变动作("被击中" .. 引擎:取随机整数(1,2))
		self:被击退(6,1,-self.方向)	

	end





	self.动作音效组.被攻击喊叫[引擎:取随机整数(1,#self.动作音效组.被攻击喊叫)]:播放()
	
	self.属性.攻击时间计次  = 0
	
	Q_屏幕.顶部动态血条:置属性(self,self.对象.血条长度,self.属性.hp,self.属性.maxhp,掉血值)
	
	self.属性.hp = self.属性.hp - 掉血值
	随机血迹(self.坐标.x + 引擎:取随机整数(-10,10),self.坐标.y+ 引擎:取随机整数(-10,10))
	if(self.属性.hp <= 0) then
		self:死亡()
	end
	
	Q_主角.命中时间 = 引擎:取运行时间()	
	
	
	local 临时掉血特效= {	激活 = true ,
							显示位置x = self.坐标.x + 4,
							显示位置y = self.坐标.y- self:取素材中心点Y()  -20,
							透明度 = 255 ,
							间隔值x = 0.3 ,
							特效大小 = 0.5 ,
							临时值 = 0 ,
							当前值 = 0 ,
							a = 0 ,
							b = 0 ,
							x = 0 ,
							y = 0 ,
							移动消失 = false,
							数字 =掉血值,
							已经消失 = false,
							临时变量 = 0
					}
	临时掉血特效.类型 = "数字"
	临时掉血特效.颜色 = "白"
	
	
	
	if (掉血值 >= 基础掉血值 * 1.4) then
		临时掉血特效.特效大小 = 0.8
		临时掉血特效.颜色 = "黄"
		
	elseif (掉血值 >= 基础掉血值 * 1.1) then
		
		临时掉血特效.特效大小 = 0.6
		临时掉血特效.颜色 = "绿"
		
		
	end
	
	
	table.insert(self.掉血特效组,临时掉血特效)	
	
	
	
	
	return true
	
	
	
	
	
end



--=============================================================================--
-- ■ 被击退
--=============================================================================--
function 类_怪物_普通类:死亡()
	
	if (self.已经死亡) then
		return
	end
	
	self.属性.hp = 0
	self.已经死亡 = true 
	self:改变动作("倒地")
	
	
	self.动作音效组.死亡喊叫音效[引擎:取随机整数(1,#self.动作音效组.死亡喊叫音效)]:播放()
	
	if (self.上次被攻击.来源.状态 == "前冲攻击" or   self.上次被攻击.来源.状态 == "小砍四") then 
		Q_系统:增加屏幕特效_物理("死亡破碎",self.坐标.x,self.坐标.y-20,self.坐标.y,4, - self.上次被攻击.来源.方向,self.属性.碎片大小)
	else
		Q_系统:增加屏幕特效_物理("死亡破碎",self.坐标.x,self.坐标.y-20,self.坐标.y,0,0,self.属性.碎片大小)
	end
	
	
	
	
	for n=1,引擎:取随机整数(5,10)		do 
		随机血迹(self.坐标.x + 引擎:取随机整数(-50,50),self.坐标.y+ 引擎:取随机整数(-10,10))
		
	end 


	self:掉落物品()

end



--=============================================================================--
-- ■ 掉落物品
--=============================================================================--
function 类_怪物_普通类:掉落物品()


	引擎:置随机数种子()
	
	local 临时掉宝  = {}
	
	
	
	for n=1,#self.掉宝物品组 do
		
		if (self.掉宝物品组[n] ~= "") then
			
			local 最大几率 = self.掉宝物品组[n].最大几率
			
			local 随机结果 = 引擎:取随机整数 (1,最大几率)
			
			
			if (随机结果 <= self.掉宝物品组[n].最小几率) then	 -- 掉宝成功
				
				临时掉宝 = {
					物品道具 = self.掉宝物品组[n].物品道具,
					掉落数量 = self.掉宝物品组[n].掉落数量
				}
				
				if (临时掉宝.物品道具.总类== "金币"  ) then
					临时掉宝.掉落数量 = math.ceil( 临时掉宝.掉落数量 * 引擎:取随机小数(0.8,1.2) )
				end
				
				
				
				Q_系统:掉落物品(临时掉宝.物品道具,self.坐标.x,self.坐标.y,临时掉宝.掉落数量) 
				
				
			end
			

			
		end
		

--		
		
		
		
	end
	
	
	
	
	
end


--=============================================================================--
-- ■ 被击退
--=============================================================================--
function 类_怪物_普通类:被击退(力量,速度,方向)

	self.击退力量 = 力量
	self.击退速度 = 速度
	self.击退方向 = 方向
	
	
	--self.AI时间 = 引擎:取运行时间 ()
	
end 


--=============================================================================--
-- ■ 倒地逻辑
--=============================================================================--
function 类_怪物_普通类:倒地逻辑()

	if (self.状态 == "倒地") then
		
		self.属性.落地时间计次 = self.属性.落地时间计次 + dt
		if (self.属性.落地时间计次 > 0.5) then
			self:停止()
		end
		
	end

end


--=============================================================================--
-- ■ 被击中逻辑
--=============================================================================--
function 类_怪物_普通类:被击中逻辑()

	if (self.状态 == "被击中1" or self.状态 == "被击中2") then
		self.属性.被击硬直计次 = self.属性.被击硬直计次 + dt
		self.可移动 = false
		self.可攻击 = false
		
		if (self.属性.被击硬直计次>=self.属性.被击硬直时间) then
			self.属性.被击硬直计次 = 0
			self:停止()
		end
	end
		
end






--=============================================================================--
-- ■ 被攻击打飞逻辑
--=============================================================================--
function 类_怪物_普通类:被攻击打飞逻辑()



	if (self.状态 == "被攻击_空中_起" or   self.状态 == "被攻击_空中_反弹起") then
		self.属性.被击弹跳力 = self.属性.被击弹跳力 - dt * 25	
		
		if (self.属性.被击弹跳力 > 0) then
			
			self.跳跃偏移 = self.跳跃偏移- self.属性.被击弹跳力
			--self.坐标.y = self.坐标.y - self.属性.被击弹跳力
			self:X方向位移(-self.方向 * self.属性.被击力量)
		else
			self:改变动作("被攻击_空中_落")
		end	
		
	end




	if (self.状态 == "被攻击_空中_落") then
		
		self.属性.被击弹跳力 = self.属性.被击弹跳力 + dt *30	

		
		if (self.跳跃偏移 < 0) then
		
			self.跳跃偏移  = self.跳跃偏移  + self.属性.被击弹跳力
		--	self.坐标.y = self.坐标.y + self.属性.被击弹跳力
			self:X方向位移(-self.方向 * self.属性.被击力量)

			
		else
			
			if (self.属性.反弹) then
				self:被打飞(self.属性.反弹力,1 ,false,false)
				self.属性.反弹 = false
			else 
				self:改变动作("倒地")
				self.属性.落地时间计次 = 0
			end
			
--			
--			if (self.属性.反弹 == false) then
--				--	Q_系统:显示特效(Q_公用_特效_管理器,"落地灰尘效果",self.坐标.x,self.坐标.y-35,1,"普通",1 )
--					
--					
--					
--					self:被打飞(self.属性.反弹力,1 ,false,false)

--					self.属性.反弹 = true
----					for n=1,引擎:取随机整数(1,3) do
----						粒子特效(self.坐标.x+引擎:取随机整数(-20,20),self.坐标.y,"落地灰层" .. 引擎:取随机整数(1,3))
----					end 	
--					
--					--角色摔落音效:播放()
--			else
--			
--					self:改变动作("倒地")
----					for n=1,引擎:取随机整数(1,3) do
----						粒子特效(self.坐标.x+引擎:取随机整数(-20,20),self.坐标.y,"落地灰层" .. 引擎:取随机整数(1,3))
----					end 	
--					
--					self.属性.落地时间计次 = 0
--					
--		--self.坐标.y = self.地平线


--			end


		end

	end


end 




--=============================================================================--
-- ■ 停止
--=============================================================================--
function 类_怪物_普通类:停止()
	
--	self.坐标.x = self.上次坐标.x
--	self.坐标.y = self.上次坐标.y 
	
	self.移动目标点.x = self.坐标.x
	self.移动目标点.y = self.坐标.y
	
	self.跳跃偏移 = 0

	self:改变动作("停止")
	self.可移动 = true
	self.可攻击 = true
		
	self.属性.攻击时间计次  = 0


end




--=============================================================================--
-- ■ 被打飞
--=============================================================================--
function 类_怪物_普通类:被打飞(弹力 ,力量,是否反弹,是否变向)

	--if (self.状态 ~="被攻击_空中_起") then
		
		self.可移动 = false
		self.可攻击 = false
		
		self.方向 =-Q_主角.方向
		
		self.属性.被击力量 = 力量
		self.属性.反弹 = 是否反弹
		
		if (self.属性.反弹) then
			self.属性.被击弹跳力 = 弹力 - self.属性.重量
			self.属性.反弹力  = self.属性.被击弹跳力 * 0.4
			self:改变动作("被攻击_空中_起")
		else
			self.属性.被击弹跳力 = 弹力
			self.属性.反弹力  = 0
			self:改变动作("被攻击_空中_反弹起")
		end
		
		self.属性.攻击时间计次  = 0
		
		
		
		
		
	--end

end 







--=============================================================================--
-- ■ 是否在攻击状态
--=============================================================================--
function 类_怪物_普通类:是否在攻击状态()

	if( self.状态 == "攻击A"
		
		) then 
		return true 
	end 

	return false 
	

	
end 





--=============================================================================--
-- ■ 是否在被攻击状态
--=============================================================================--
function 类_怪物_普通类:是否在被攻击状态()

	if( self.状态 == "被击中1" or 
		self.状态 == "被击中2" or 
		self.状态 == "被攻击_空中_起" or 
		self.状态 == "被攻击_空中_落" or 
		self.状态 == "被攻击_空中_反弹起" or
		self.状态 == "空中被击中1" or
		self.状态 == "空中被击中2" 
		
		) then 
		return true 
	end 

	return false 
	

	
end 






--=============================================================================--
-- ■ 伤害计算
--=============================================================================--

function 类_怪物_普通类:伤害计算(技能ID,本次目标)	

	local 本次命中值 = 0
	local 最终伤害  = 0
	local 基础伤害  = 0
	
	if (技能ID == 0) then
		
		
		基础伤害 = math.ceil( (self.属性.物理攻击 * 3 - 本次目标.属性.物理防御*2) * 引擎:取随机小数(0.9 ,1)) 
		
		
		最终伤害 = math.ceil( 基础伤害 * 引擎:取随机小数(1.1 ,1.3 ))      
		
		if ( 最终伤害 <= 0 ) then 
			最终伤害 = 引擎:取随机整数(1,5)				
			基础伤害 = 引擎:取随机整数(1,5)	
		end 
		
		
	end
	


	
	return 最终伤害,基础伤害

	
	
end







--=============================================================================--
-- ■ 动作更新
--=============================================================================--

function 类_怪物_普通类:动作更新()	

	self:PAK动画更新(self.动作信息[self.状态].帧率,self.动作信息[self.状态].起始帧,self.动作信息[self.状态].结束帧,"普通")   
	
end 



--=============================================================================--
-- ■ 取素材中心点Y
--=============================================================================--

function 类_怪物_普通类:取素材中心点Y()	
	
	return math.ceil( self.参照动画.动画包围盒:取高度()/2)
	
end




--=============================================================================--
-- ■ 掉血动画显示
--=============================================================================--
function 类_怪物_普通类:掉血动画显示()

	for n=1, table.getn(self.掉血特效组) do
	
		if(self.掉血特效组[n].透明度 < 10) then 
			table.remove(self.掉血特效组,n)
			break
		end 
	
	end 




	for n=1, table.getn(self.掉血特效组) do

		if(self.掉血特效组[n].已经消失==false )then 
		
		
			if (self.掉血特效组[n].激活) then
			
				self.掉血特效组[n].当前值 = self.掉血特效组[n].当前值 + self.掉血特效组[n].间隔值x
				
				if (self.掉血特效组[n].当前值 >= 3 or self.掉血特效组[n].当前值 <= 0) then
					self.掉血特效组[n].间隔值x = -self.掉血特效组[n].间隔值x
				end
				
				if (self.掉血特效组[n].类型 == "数字") then
				
					self.掉血特效组[n].a = self.掉血特效组[n].当前值 *15 * self.掉血特效组[n].特效大小
					self.掉血特效组[n].b = self.掉血特效组[n].当前值 * 13 * self.掉血特效组[n].特效大小
					self.掉血特效组[n].x = self.掉血特效组[n].当前值 * string.len(tostring (self.掉血特效组[n].数字)) * 8  * self.掉血特效组[n].特效大小
					self.掉血特效组[n].y = self.掉血特效组[n].当前值 * 7 *self.掉血特效组[n]. 特效大小
					
				elseif (self.掉血特效组[n].类型 == "文字") then 	
					self.掉血特效组[n].a = self.掉血特效组[n].当前值 * 65 * self.掉血特效组[n].特效大小
					self.掉血特效组[n].b = self.掉血特效组[n].当前值 * 65 * self.掉血特效组[n].特效大小
					self.掉血特效组[n].x = self.掉血特效组[n].当前值 * 16 * self.掉血特效组[n].特效大小
					self.掉血特效组[n].y = self.掉血特效组[n].当前值 * 15 *self.掉血特效组[n]. 特效大小
					
				end 

				if (self.掉血特效组[n].间隔值x < 0 and self.掉血特效组[n].当前值 * self.掉血特效组[n].特效大小 <=1) then
					self.掉血特效组[n].激活 = false
					self.掉血特效组[n].移动消失 = true
				end
				
				
			end
		
		
			if (self.掉血特效组[n].移动消失) then

				self.掉血特效组[n].临时值 = self.掉血特效组[n].临时值 + 1
				self.掉血特效组[n].y = self.掉血特效组[n].y + 3
				
				
				if (self.掉血特效组[n].临时值 > 10) then
					self.掉血特效组[n].透明度 = self.掉血特效组[n].透明度 - 30
				end

			end

			
			if (self.掉血特效组[n].透明度 > 10) then
				if (self.掉血特效组[n].类型 == "数字") then
					Q_屏幕.掉血精灵文字:显示(self.掉血特效组[n].数字,
								 self.掉血特效组[n].显示位置x - self.掉血特效组[n].x + Q_游戏数据.画面偏移.x ,
								  self.掉血特效组[n].显示位置y - self.掉血特效组[n].y + Q_游戏数据.画面偏移.y , 
								  self.掉血特效组[n].a, 
								  self.掉血特效组[n].b, 
								  self.掉血特效组[n].透明度,
								  self.掉血特效组[n].颜色)
				elseif (self.掉血特效组[n].类型 == "文字") then 
				
					if (self.掉血特效组[n].文字 == "MISS") then
						MISS精灵:置颜色(ARGB(self.掉血特效组[n].透明度,255,255,255))

						MISS精灵:显示_高级(self.掉血特效组[n].显示位置x - self.掉血特效组[n].x + Q_游戏数据.画面偏移.x ,
												 self.掉血特效组[n].显示位置y - self.掉血特效组[n].y + Q_游戏数据.画面偏移.y , 
												 0,
												 self.掉血特效组[n].a/65, 
												 self.掉血特效组[n].b/65)
					end 
					
					
					
				end 
				
				
			else 
				
				self.掉血特效组[n].移动消失 = false
				self.掉血特效组[n].已经消失 = true 

			end 
			

		end 

		
	end
	
	


end 




--=============================================================================--
-- ■ pak动画更新
--=============================================================================--
function 类_怪物_普通类:PAK动画更新(帧率,开始帧,结束帧,更新方式)
	
	
	if (更新方式 == "普通") then
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:更新(帧率, 开始帧,结束帧)
		end
	elseif (更新方式 == "往返") then
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:往返更新(帧率, 开始帧,结束帧)
		end
	elseif (更新方式 == "反向") then
		for n=1,#self.纸娃娃组 do
			self.纸娃娃组[n].动画:反向更新(帧率, 开始帧,结束帧)
		end
	end
	
	
end 




--=============================================================================--
-- ■ PAK动画重置
--=============================================================================--
function 类_怪物_普通类:PAK动画重置()

	for n=1,#self.纸娃娃组 do
		self.纸娃娃组[n].动画:重置()
	end

end 


--=============================================================================--
-- ■ PAK动画置颜色
--=============================================================================--
function 类_怪物_普通类:PAK动画置颜色(颜色值)

	for n=1,#self.纸娃娃组 do
		self.纸娃娃组[n].动画:置颜色(颜色值)
	end

end 


--=============================================================================--
-- ■ PAK动画置混合
--=============================================================================--
function 类_怪物_普通类:PAK动画置混合(混合模式)

	for n=1,#self.纸娃娃组 do
		self.纸娃娃组[n].动画:置混合(混合模式)
	end
end 



--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 类_怪物_普通类:销毁(销毁)
	
	
	
end





