--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年8月25日14时11分29秒
--=============================================================================--

NPC对话框类  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function NPC对话框类:初始化()

	self.背景图片 = 引擎:载入图片("Dat/ui/npc_dialog_ui/背景图片.png")
	self.背景精灵 = D2D_精灵.创建(self.背景图片,0,0,618,165)
	
	self.中间横杠拖图片 = 引擎:载入图片("Dat/ui/npc_dialog_ui/4.png")
	self.中间横杠拖精灵 = D2D_精灵.创建(self.中间横杠拖图片,0,0,425,1)
	
	self.下页图片A = 引擎:载入图片("Dat/ui/npc_dialog_ui/17.png")
	self.下页图片A精灵 = D2D_精灵.创建(self.下页图片A,0,0,34,34)
	
	self.下页图片B = 引擎:载入图片("Dat/ui/npc_dialog_ui/15.png")
	self.下页图片B精灵 = D2D_精灵.创建(self.下页图片B,0,0,34,34)
	self.下页图片B精灵:置混合模式(混合_颜色乘)

	self.下页透明度 = 100
	self.下页中间值 = 5
	

	self.头像精灵 = D2D_精灵.创建(0,0,0,0,0)
	
	--self.退出按钮 = 扩展_四层按钮.创建("Dat/ui/退出按钮/",570,505)

	self.可视 = false
	
	self.头像偏移 = {x=0,y=0}
	self.标题 = ""

	self.内容 = ""
	self.风格提示= {
			风格文字组 = {},
			宽度 = 0,
			高度 = 0
	}
	
	self.NPC选择内容 ={}
	
	self.坐标 = {x=120,y=380}
	

	
	 self.选择x偏移= 155
	 self.选择y偏移= 45
	 self.间距 = 4
	
	self.计时器 = 0
	self.间隔时间  = 0.05
	self.本页结束 = false
	
	self.页数 = 1
	self.当前页 = 1
	
	self.提示信息组 = {}
	
	self.打字计次 = 0

end






--=============================================================================--
-- ■ 更新
--=============================================================================--
function NPC对话框类:更新()

	if (self.可视) then 
--		self.退出按钮:更新()
--		if ( self.退出按钮:取是否单击() ) then 
--			self:关闭()
--		end 
	
	self.计时器 =self.计时器 + dt
	
	
	if(self.本页结束  == false and self.内容 ~= "" and self.风格提示.风格文字组[table.getn(self.风格提示.风格文字组)].当前计次 ~= table.getn(self.风格提示.风格文字组[table.getn(self.风格提示.风格文字组)].字符组)) then 
		if(self.计时器 > self.间隔时间)then
		
			for n=1,table.getn(self.风格提示.风格文字组) do 
				if(self.风格提示.风格文字组[n].当前计次 < table.getn(self.风格提示.风格文字组[n].字符组)) then 
					self.风格提示.风格文字组[n].当前计次 = self.风格提示.风格文字组[n].当前计次 + 1
					self.风格提示.风格文字组[n].当前文本 = self.风格提示.风格文字组[n].当前文本 ..self.风格提示.风格文字组[n].字符组 [self.风格提示.风格文字组[n].当前计次]
					break
				end 
				
			end 
				
			
			self.计时器 = 0
		end
		
		self.打字计次  = self.打字计次  + dt 
		if (self.打字计次 > 0.2) then 
			Q_游戏数据.音效组.打字:播放()
			self.打字计次 = 0
		end 
		
		
		
		
		
		if (引擎:取按键按下(键_鼠标左) or 引擎:取按键按下(键_回车)) then 
			self.间隔时间 = 0
			self.本页结束 = true
			return 
		end 
		
		
	else 
		self.本页结束 = true
	end 
	
	
	if ( self.本页结束 ) then 
		if (引擎:取按键按下(键_鼠标左) or 引擎:取按键按下(键_回车)) then 
			if (self.当前页 < self.页数) then 
				Q_游戏数据.音效组.NPC对话框翻页:播放()
				self:翻页(self.当前页+1)
			else 
				self:关闭()
			end 

		end 
	end 
	
	

	
	
	
	end 

end


-- ■ 翻页
--=============================================================================--
function NPC对话框类:翻页(页面)

	
	self.当前页 = 页面
	self.内容 = self.提示信息组[self.当前页]
	self.风格提示.风格文字组, self.风格提示.宽度, self.风格提示.高度  =  格式化文字(文字_16号,self.内容,4)
	self.计时器 = 0
	self.间隔时间  = 0.05
	self.本页结束  = false
	
	
end 


--=============================================================================--
-- ■ 关闭
--=============================================================================--
function NPC对话框类:关闭()

	Q_游戏数据.音效组.窗口关闭:播放()
	self.可视 = false 

	
end 


--=============================================================================--
-- ■ 打开
--=============================================================================--
function NPC对话框类:打开(NPC标识,标题,头像偏移x,头像偏移y)

	self.头像偏移.x = 头像偏移x
	self.头像偏移.y = 头像偏移y
	
	local 本次NPC对象 = Q_游戏数据.游戏NPC组[NPC标识]
	
	if (本次NPC对象 ~= nil ) then 
		if (本次NPC对象.对话头像 ~= "") then
			self.头像精灵:置图片(本次NPC对象.对话头像图片)
			self.头像精灵:置显示区域(0,0,引擎:取图片宽度(本次NPC对象.对话头像图片),引擎:取图片高度(本次NPC对象.对话头像图片))
		end
	end
	

	
	self.标题 = 标题
	self.可视 = true 
	
	
end 


--=============================================================================--
-- ■ 显示
--=============================================================================--
function NPC对话框类:显示()

	if (self.可视) then 
		self.背景精灵:显示(13,300)
		self.头像精灵:显示(13 + self.头像偏移.x ,300+self.头像偏移.y)
		self.中间横杠拖精灵:显示(170,340)
		文字_描边显示(文字_16号,190,315,self.标题,-1784166,-16777216)
		
		
		
		--_文字_描边显示(275,390,self.标题,颜色_青,颜色_黑)
		
	--	文字_16号:置颜色(-1784166)
	--	文字_16号:显示(200,350,"如果有人想找您帮忙")
		
		

		
		
		for n=1,table.getn(self.风格提示.风格文字组) do 
			--文字_描边显示(文字_16号,190,350,"如果有人想找您帮忙",-1784166,颜色_黑)
			if (self.间隔时间 == 0) then 
				文字_描边显示(文字_16号,190+self.风格提示.风格文字组[n].位置.x,350+self.风格提示.风格文字组[n].位置.y,self.风格提示.风格文字组[n].内容,self.风格提示.风格文字组[n].颜色,-16777216)
			else 
				文字_描边显示(文字_16号,190+self.风格提示.风格文字组[n].位置.x,350+self.风格提示.风格文字组[n].位置.y,self.风格提示.风格文字组[n].当前文本,self.风格提示.风格文字组[n].颜色,-16777216)
			end 
		end 


		if (self.本页结束) then 
			self.下页透明度 = self.下页透明度 + self.下页中间值
			if ( self.下页透明度 < 10 or self.下页透明度>150) then 
				self.下页中间值 = -self.下页中间值
			end 
	
			self.下页图片B精灵:置颜色(ARGB(self.下页透明度,255,255,255))
			self.下页图片B精灵:显示(550,425)
			self.下页图片A精灵:显示(550,425)

		end 
		
		--self:显示脚本解析()
		--_文字_描边显示(275,420,"你想要了解什么:",颜色_白,颜色_黑)
		
		

		
--		self.退出按钮:显示()
		
	end 
	
	
	

end



--=============================================================================--
-- ■ 置提示()
--=============================================================================--

function NPC对话框类:提示( ... )

	self.提示信息组 = arg
	self.页数 = table.getn(self.提示信息组)
	self.当前页 = 1
	self.NPC选择内容 = {}
	self.内容 = self.提示信息组[1]
	self.风格提示.风格文字组, self.风格提示.宽度, self.风格提示.高度  =  格式化文字(文字_16号,self.内容,4)
	self.计时器 = 0
	self.间隔时间  = 0.05
	self.本页结束  = false 
	self.可视 = true
	
	

	
end



--=============================================================================--
-- ■ 显示脚本解析()
--=============================================================================--

function NPC对话框类:显示脚本解析()

	local 颜色值 = 0
	self.事件激活 = false 

             
                 for n=1, table.getn(self.NPC选择内容) do

                      self.NPC选择内容[n].包围盒:置位置(self.坐标.x+self.选择x偏移 , self.坐标.y+ self.风格提示.高度+(n-1) * (Q_文字高度14+self.间距)+self.选择y偏移)
                 --     self.NPC选择内容[n].包围盒:显示()
                 
                      if ( self.NPC选择内容[n].包围盒:检测_点(Q_鼠标坐标.x,Q_鼠标坐标.y)) then
					
					self.事件激活 = true 

					颜色值 = 颜色_黄
					

					if (引擎:取按键弹起(键_鼠标左)) then
								
						if(self.NPC选择内容[n].跳转链接 == "exit") then
							self:关闭()
						else
							if (self.NPC选择内容[n].跳转链接 ~= nil) then
								执行脚本函数(self.NPC选择内容[n].跳转链接)
								break
							end

						end

					end

                      else
				   颜色值 = -1712965
                      end


		
                       _文字_描边显示 (self.坐标.x+self.选择x偏移 , 
			     self.坐标.y+ self.风格提示.高度+(n-1) * (Q_文字高度14+self.间距)+self.选择y偏移 ,
			     self.NPC选择内容[n].基本内容,
			     颜色值,
			     颜色_黑
			     )
			     
			     
				引擎:画线(self.坐标.x+self.选择x偏移, 
							self.坐标.y+ self.风格提示.高度+(n-1) * (Q_文字高度14+self.间距)+self.选择y偏移 + Q_文字高度14+1,
							self.坐标.x+self.选择x偏移+文字_16号:取宽度(self.NPC选择内容[n].基本内容),
							self.坐标.y+self.风格提示.高度+(n-1) * (Q_文字高度14+self.间距)+self.选择y偏移 + Q_文字高度14+1,
							-1712965
				)


                 end

   


          文字_16号:置颜色(颜色_白)
	



end 




--=============================================================================--
-- ■ 销毁
--=============================================================================--
function NPC对话框类:销毁()




end 





