--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年5月1日17时34分5秒
--=============================================================================--

类_界面_选人  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_界面_选人:初始化()
	
	self.背景图片 = 引擎:载入图片("Dat/ui/选人背景.png")
	self.背景精灵 = D2D_精灵.创建(self.背景图片,0,0,640,480)

	
	self.女格斗选择按钮 = 类_三层序列图按钮.创建("Dat/ui/女格斗选择按钮.png",25, 400,false)
	self.女格斗家展示图片 = 引擎:载入图片("Dat/ui/女格斗家_展示.png")
	self.女格斗家展示精灵 = D2D_精灵.创建(self.女格斗家展示图片,0,0,271,480)
	
	
	self.男格斗选择按钮 = 类_三层序列图按钮.创建("Dat/ui/男格斗选择按钮.png",105, 400,false)
	self.男格斗家展示图片 = 引擎:载入图片("Dat/ui/男格斗家_展示.png")
	self.男格斗家展示精灵 = D2D_精灵.创建(self.男格斗家展示图片,0,0,291,479)
	
	
	self.按钮按下音效 = D2D_音效.创建("Dat/sound/ui/button_04.wav")
	
	if (Q职业 == nil) then 
		Q职业 = "女格斗家"
	end 
	
	self.移动进度 = 0
	self.移动偏移 = 25
	
	self.当前选中 = 1
	
	
	self.进入游戏按钮 = 类_三层序列图按钮.创建("Dat/ui/模板按钮A.png",325, 450,false)
	self.进入游戏按钮:置按钮文本("进入游戏")
	
	
	
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_界面_选人:更新()

	self.女格斗选择按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	self.男格斗选择按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	
	self.进入游戏按钮:更新(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	
	
	
	if ((self.女格斗选择按钮:取是否单击() ))then 
		if (Q职业 ~= "女格斗家") then
			Q职业= "女格斗家"
			self.移动偏移 = 25
			self.移动进度 = 0
		end
		
		self.按钮按下音效:播放()
		
		
	elseif ((self.男格斗选择按钮:取是否单击() ))then 
		
		if (Q职业 ~= "男格斗家") then
			Q职业= "男格斗家"
			self.移动偏移 = 25
			self.移动进度 = 0
			
		end
		
		
		self.按钮按下音效:播放()
	end 
	
	
	
	if (Q职业 == "男格斗家") then 
		
		self.男格斗选择按钮.禁用 = true
		self.女格斗选择按钮.禁用 = false
		
	elseif (Q职业 == "女格斗家") then 
		
		self.女格斗选择按钮.禁用 = true
		self.男格斗选择按钮.禁用 = false
		
	end 
	
	
	
	if ((self.进入游戏按钮:取是否单击() ))then 
		
		Q_游戏数据.进度  = 2
		Q_屏幕 = 类_主屏幕.创建()
		Q_屏幕:对象初始化()
		
	end
	
	
	
	
	if (self.移动偏移 >  0) then 	
		self.移动偏移 = self.移动偏移 - 1
		self.移动进度 = self.移动进度 + self.移动偏移
	end 
	
	
	
	
end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_界面_选人:显示()
	
	self.背景精灵:显示()
	
	if (Q职业 == "女格斗家") then 
		self.女格斗家展示精灵:显示(-300+self.移动进度,0)
	elseif (Q职业 == "男格斗家") then 
		self.男格斗家展示精灵:显示(-300+self.移动进度,0)
	end
	
	
	self.女格斗选择按钮:显示()
	self.男格斗选择按钮:显示()
	self.进入游戏按钮:显示()
	
	
	
	

end





