--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
--=============================================================================--
游戏NPC类  = class()


--=============================================================================--
-- ■ 构造函数
--=============================================================================--

function 游戏NPC类:初始化(NPC对象,x坐标,y坐标,方向)	

	
	self.标识类型 = "游戏NPC"
	
	self.开始帧 = NPC对象.开始帧
	self.结束帧 = NPC对象.结束帧

	self.类型 =  NPC对象.类型
	self.NPC对象 = NPC对象
	self.NPC动画 =  类_新PAK类.创建("Dat/pak/npc/" .. NPC对象.资源文件,self.开始帧,true)	
	self.NPC动画:置中心点(NPC对象.中心点x,NPC对象.中心点y)
	
	self.NPC标识 = NPC对象.标识 
	
	self.动作 = "静止"
	
	self.帧率 = NPC对象.帧率 
	self.名称y偏移 = NPC对象.名称y偏移
	self.名称x偏移 = NPC对象.名称x偏移
	
	self.方向 = 方向
	self.名称 = NPC对象.名称
	self.坐标 = {x = x坐标,y = y坐标}
	self.排序参照点 = self.坐标.y 
	self.霸体 = true 
	
	self.动画计次 = 0
	self.上一帧动画 = 0
	
--	self.任务标志 = 0
--	self.任务变量 = 0
--	
--	self.可接任务图片 = 取图片纹理("Dat/other/问号.png")
--	self.可接任务动画 =  D2D_动画.创建(self.可接任务图片.图片,8,4,0,0,35,42)
--	self.可接任务动画:置中心点(19,35)
--	self.可接任务动画:播放()

--	self.完成任务图片 = 取图片纹理("Dat/other/感叹号.png")
--	self.完成任务动画 =  D2D_动画.创建(self.完成任务图片.图片,4,4,0,0,28,42)
--	self.完成任务动画:置中心点(16,35)
--	self.完成任务动画:播放()
--	
end 




--=============================================================================--
-- ■ 更新
--=============================================================================--

function 游戏NPC类:更新()	

	self.上一帧动画 = self.NPC动画:取间隔帧()
	
	if (self.动作 == "静止") then 
		self.NPC动画:更新(self.帧率,self.开始帧,self.开始帧)
		self.动画计次 = self.动画计次 + dt 
		
		if (self.动画计次 > 2) then 
			self.动作 = "动画"
			self.动画计次  = 0
		end 
		
	else 
		self.NPC动画:更新(self.帧率,self.开始帧,self.结束帧)
		
		if (self.上一帧动画 == self.结束帧 - self.开始帧 and self.NPC动画:取间隔帧() == 0) then 
			self.动作 = "静止"
			self.动画计次  = 0
		end 
		
	end 
--	if ( self.任务标志 == 1) then 
--	
--		self.完成任务动画:更新(dt)
--		
--	elseif ( self.任务标志 == 2) then 
--		
--		self.可接任务动画:更新(dt)
--		
--	end 
	self.NPC动画.边线可视  = false 
	
	if(Q_屏幕.鼠标窗口全id ==0 and  self.NPC动画.动画包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)  and Q_菜单.是否显示 == false) then
		
		
		--if (Q_游戏鼠标.模式 ~= "出售" and   Q_游戏鼠标.模式 ~= "购买") then 
		if (self.类型 == "交易") then 
			Q_游戏鼠标.模式 = "交易"
		else 
			Q_游戏鼠标.模式 = "对话"
		end 
		--end 


		self.NPC动画.边线可视  = true

		--self.NPC动画:置颜色(ARGB(255,170,170,170))
		--self.NPC动画:置混合(混合_灯光)
		
		if ( 引擎:取按键按下(键_鼠标左) ) then 
			
			if (self.坐标.x > Q_主角.坐标.x) then 
				self.方向 = 1
			else
				self.方向 = -1
			end 

			if (Q_NPC脚本组[self.NPC标识]  ~= nil) then
				Q_NPC脚本组[self.NPC标识].Main()
			end
			
		end 
		
		
	end

	
	
	
	
	
	
--	if(self.NPC动画:精确判断是否选中(鼠标坐标.x,鼠标坐标.y) ~=0 )then
--	
--		self.NPC动画:置混合模式(混合_灯光)
--		
--		if(引擎:取按键按下(键_鼠标左)) then
--			self:执行脚本()
--		end
--		
--	else
--		self.NPC动画:置混合模式(混合_默认)
--	end




end 





--=============================================================================--
-- ■ 显示影子
--=============================================================================--
function 游戏NPC类:显示影子()

--	if ( Q_地图配置.阴影 == "日光" ) then 
	
		self.NPC动画.影子可视 = true
		self.NPC动画.影子透明度 = 80
		self.NPC动画.影子y偏移 = __ED_精灵_取高度(self.NPC动画.碎图片精灵)*0.6

		
		
--	else 

--		self.NPC动画:置颜色(ARGB(50,255,255,255))
--		self.NPC动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x ,self.排序参照点 + Q_游戏数据.画面偏移.y+5,self.方向)


--	end 


end 


--=============================================================================--
-- ■ 显示
--=============================================================================--

function 游戏NPC类:显示()	

	self:显示影子()
	
	
--	if (self.霸体) then 

--		self.NPC动画.碎图片精灵:置混合模式(混合_单色)
--		self.NPC动画.碎图片精灵:置颜色(ARGB(255 ,255,255,0))
----		
----		self.NPC动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x ,self.坐标.y + Q_游戏数据.画面偏移.y,self.方向*1.01,1.01)
----		self.NPC动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x + 1,self.坐标.y + Q_游戏数据.画面偏移.y,self.方向*1.01,1.01)
----		self.NPC动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x ,self.坐标.y + Q_游戏数据.画面偏移.y+2,self.方向*1.01,1.01)

--		
--		self.NPC动画.碎图片精灵:显示_高级(self.NPC动画.临时位置.x +2 ,self.NPC动画.临时位置.y ,0,self.方向,1)

--	end 
	

	
	self.NPC动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y+ Q_游戏数据.画面偏移.y,self.方向)	
	
	

	
--	if ( self.任务标志 == 1) then 
--	
--		self.完成任务动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y+ Q_游戏数据.画面偏移.y - self.NPC动画.临时高度 - self.头顶精灵:取高度()/2)
--		
--	elseif ( self.任务标志 == 2) then 
--		
--		self.可接任务动画:显示(self.坐标.x + Q_游戏数据.画面偏移.x,self.坐标.y+ Q_游戏数据.画面偏移.y - self.NPC动画.临时高度 - self.头顶精灵:取高度()/2)
--		
--	end 
--	
	
	文字_描边显示(文字,self.坐标.x + Q_游戏数据.画面偏移.x +self.名称x偏移  ,self.坐标.y+ Q_游戏数据.画面偏移.y + self.名称y偏移,self.名称,-1652581,-16777216)
	
	
	if (Q_调试) then 
		引擎:画圆(self.坐标.x+ Q_游戏数据.画面偏移.x ,self.坐标.y+ Q_游戏数据.画面偏移.y, 5,50,颜色_红)
	end 
	
	
	
	--self.NPC动画.动画包围盒:显示()
	
	
--	文字_隶书:置颜色(颜色_黄)
--	文字_隶书:显示 (取整 (self.脚底点.x  ) - 文字_隶书:取宽度 (self.名称) / 2, 取整 (self.脚底点.y  - self.NPC动画.临时高度  -10) , self.名称)
	
	
end 



--=============================================================================--
-- ■ 执行脚本
--=============================================================================--
function 游戏NPC类:执行脚本()

                  if (self.脚本内容 ~= "") then
                      执行脚本_文本(self.脚本内容)
                  end

end



--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 游戏NPC类:销毁()
	
	self.NPC动画:销毁()
	--self.头顶精灵:销毁()
	--self.可接任务动画:销毁()
	--self.完成任务动画:销毁()
	--引擎:销毁图片(self.头顶图片 )
	
	
	
	
end 