--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年4月17日10时29分43秒
--=============================================================================--

类_系统类  = class()


--=============================================================================--
-- ■ 系统:发射子弹()
--=============================================================================--

function 类_系统类:发射子弹(发射点x,发射点y,角度,速度,射程,类型,方向,地平线,发射者,目标类型)

	local 临时子弹 = 子弹类.创建(发射点x,发射点y,角度,速度,射程,类型,方向,地平线,发射者,目标类型)	
	table.insert(Q_屏幕.屏幕子弹组,临时子弹)
	Q_屏幕:增加屏幕物件(临时子弹)

end





--=============================================================================--
-- ■ 系统:播放背景音效()
--=============================================================================--

function 类_系统类:播放背景音效(音效名称)
	
	

--	if (Q_游戏数据.背景音乐.标识 ~= 音效名称) then 
--	
--		if (Q_游戏数据.背景音乐.标识 ~= "") then 
--			Q_游戏数据.背景音乐.音效:停止()
--		end 
--		
--		Q_游戏数据.背景音乐.标识 = 音效名称
--		Q_游戏数据.背景音乐.音效 = Audiere音效.创建("Dat/music/" .. 音效名称) 
--		
--		Q_游戏数据.背景音乐.音效:置循环模式(true)
--		
--	--	Q_游戏数据.背景音乐.音效:改变音量(Q_配置.背景音乐音量)
--		--Q_游戏数据.背景音乐.音效:播放_高级(Q_配置.背景音乐音量,true)
--		Q_游戏数据.背景音乐.音效:播放()
--		
--		
--	end 
--	
	
--	Q_游戏数据.背景音乐.音效:改变音量(Q_配置.背景音乐音量)
	

	
	
end 



--=============================================================================--
-- ■ 系统:跳转到地图()
--=============================================================================--

function 类_系统类:跳转到地图(地图名称,x,y)
	
	
	Q_主角.坐标.x = x
	Q_主角.坐标.y = y
	Q_地图:加载地图(地图名称)
	Q_游戏数据.音效组.瞬移音效:播放()
	Q_系统:增加屏幕特效("瞬移", "跟随主角",300,300,1,1,0,1)
	
end





--=============================================================================--
-- ■ 系统:打开商店()
--=============================================================================--

function 类_系统类:打开商店(NPC标识,商店说明,行数,...)
	
	--Q_屏幕.商店窗口:销毁商店物品()
	
	
	

	if (Q_屏幕.上次商店.NPC标识 == NPC标识 and Q_屏幕.上次商店.行数 == 行数) then
		
		if (Q_屏幕.包裹窗口.可视 == false) then
			Q_屏幕.包裹窗口:打开(320,12)
		end
		
		
		Q_屏幕.商店窗口:打开(30,12)
		
		
		return
	end 
	
	
	
	
	
	
	
	local 本次NPC对象 = Q_游戏数据.游戏NPC组[NPC标识]
	
	if ( 本次NPC对象 ~= nil ) then
		
		if (本次NPC对象.窗口头像 ~= "") then
			Q_屏幕.商店窗口.商店窗口头像精灵:置图片(本次NPC对象.窗口头像图片)
			Q_屏幕.商店窗口.商店窗口头像精灵:置显示区域(0,0,引擎:取图片宽度(本次NPC对象.窗口头像图片),引擎:取图片高度(本次NPC对象.窗口头像图片))
		end
		
	end
	
	Q_屏幕.商店窗口.提示信息 =  string.gsub(商店说明, "	","")
	
	Q_屏幕.商店窗口:销毁商店物品()

	Q_屏幕.上次商店.NPC标识 = NPC标识
	Q_屏幕.上次商店.行数 = 行数
	

	local  项目个数 = table.getn(arg)
	local 分割组 = {}
	local 格子位置 = 0
   
	if(行数<5) then 
		行数 = 5
	end 
	

	Q_屏幕.商店窗口:重置(行数)
	
	
	for k=1, 项目个数 do
		分割组 = 分割文本(arg[k],"|")

		
		for n=1, table.getn(Q_游戏数据.游戏道具组) do
		
			if (Q_游戏数据.游戏道具组[n].名称 == 分割组[3]) then
				
				
				格子位置 = ( tonumber(分割组[1]) - 1 ) * 7 + tonumber(分割组[2])
		
				Q_屏幕.商店窗口.商店格子[格子位置]:置道具(Q_游戏数据.游戏道具组[n],1,false)
				
				--Q_游戏商店窗口:置商店物品(n)
				--调试输出(分割组[3],n)
			
				break
			end
		
		end
			
	end 
	
	Q_屏幕.商店窗口:打开(30,12)
	if (Q_屏幕.包裹窗口.可视 == false) then
		Q_屏幕.包裹窗口:打开(320,12)
	end


----   Q_游戏商店窗口:清空商店()

--	if (Q_包裹窗口.可视 == false) then
--		Q_包裹窗口:开关()
--	end

--	if (Q_分解强化窗口.可视) then 
--		Q_分解强化窗口:开关()
--	end 



--	for k=1, 项目个数 do
--		分割组 = 分割文本(arg[k],"|")

--		
--		for n=1, table.getn(Q_游戏数据.游戏道具组) do
--		
--			if (Q_游戏数据.游戏道具组[n].名称 == 分割组[3]) then
--				格子位置 = ( tonumber(分割组[1]) - 1 ) * 7 + tonumber(分割组[2])
--				Q_商店窗口.商店格子[格子位置]:置道具(n,false,1)
--				
--				--Q_游戏商店窗口:置商店物品(n)
--				--调试输出(分割组[3],n)
--			
--				break
--			end
--		
--		end
--			
--	end 


--	Q_商店窗口:开关()

end









--=============================================================================--
-- ■ 系统:显示NPC()
--=============================================================================--

function 类_系统类:显示NPC(NPC标识,x,y,方向)
	
	
	local 本次NPC = Q_游戏数据.游戏NPC组[NPC标识]
	
	if ( 本次NPC ~= nil ) then
		
		local 临时NPC = 游戏NPC类.创建(本次NPC,x,y,方向)
		
		table.insert(Q_屏幕.屏幕NPC组,临时NPC)
		Q_屏幕:增加屏幕物件(临时NPC)
		
		
	else
		Log__("找不到NPC->" .. NPC标识)
	end
	
--	for n=1,#Q_游戏数据.游戏NPC组 do 
--		
--		if ( Q_游戏数据.游戏NPC组[n].标识 == NPC标识 ) then 
--			
--			local 临时NPC = 游戏NPC类.创建(n,x,y,方向)
--			
--			table.insert(Q_屏幕.屏幕NPC组,临时NPC)
--			Q_屏幕:增加屏幕物件(临时NPC)
--			
--			return 
--		end 
--	end 
	

end 






--=============================================================================--
-- ■ 增加屏幕特效
--=============================================================================--
function 类_系统类:增加屏幕特效(特效名称,特效类型,x坐标,y坐标,显示w,显示h,弧度,显示次数)
	
	local 特效 = 特效类.创建(特效名称,特效类型,x坐标,y坐标,显示w,显示h,弧度,显示次数)
	
	table.insert(Q_屏幕.屏幕特效组,特效)
	Q_屏幕:增加屏幕物件(特效)


end


--=============================================================================--
-- ■ 增加屏幕特效_物理
--=============================================================================--
function 类_系统类:增加屏幕特效_物理(特效名称,起始x坐标,起始y坐标,地平线参考,力度,方向,大小)
	
	
	
	local 物理特效 = 特效_物理行为类.创建(特效名称,起始x坐标,起始y坐标,地平线参考,力度,方向,大小)
	
	table.insert(Q_屏幕.屏幕特效组,物理特效)
	Q_屏幕:增加屏幕物件(物理特效)
	
	


end








--=============================================================================--
-- ■ 增加怪物
--=============================================================================--
function 类_系统类:增加怪物(x坐标,y坐标,标识)
	
	local 对象 = Q_游戏数据.游戏怪物组[标识]
	
	if ( 对象 ~= nil ) then
		
		local 怪物 = 类_怪物_普通类.创建(x坐标,y坐标,对象)
		table.insert(Q_屏幕.屏幕怪物组,怪物)
		Q_屏幕:增加屏幕物件(怪物)
		
		
	end
	


end





--=============================================================================--
-- ■ 系统:增加金币()
--=============================================================================--

function 类_系统类:增加金币(数量)

	if (数量>0) then 
		Q_游戏数据.音效组.金币掉落音效:播放()
		MSG(1,string.format("获得%d金币" ,数量),-1652581 ,颜色_全透明)
	else 
		Q_游戏数据.音效组.金币掉落音效:播放()
		MSG(1,string.format("失去%d金币" ,-数量),-1652581 ,颜色_全透明)
	end 



    Q_游戏数据.金币 = Q_游戏数据.金币 + 数量

     

end







--=============================================================================--
-- ■ 掉落物品
--=============================================================================--

function 类_系统类:掉落物品(物品,坐标x,坐标y,数量,随机属性,附加倍数) 
	
	if (附加倍数 ==nil) then
		附加倍数 = 1
	end
	
	
	local 地面物品 = nil
	
	if (type(物品) == "string") then 
		
		
		if  ( 随机属性 ) then 
			地面物品  = 类_地图物品类.创建(复制表(从名称取物品(物品)),坐标x,坐标y,数量,随机属性,附加倍数)
		else 
			地面物品  = 类_地图物品类.创建(从名称取物品(物品),坐标x,坐标y,数量,随机属性,附加倍数)
		end 
		
		
		
	else 
		if  ( 随机属性 ) then 
			地面物品  = 类_地图物品类.创建(复制表(物品),坐标x,坐标y,数量,随机属性,附加倍数)
		else 
			地面物品  = 类_地图物品类.创建(物品,坐标x,坐标y,数量,随机属性,附加倍数)
		end 
		
	end 
	


	table.insert(Q_屏幕.地面物品组,地面物品)
	Q_屏幕:增加屏幕物件(地面物品)


end 










