--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年9月7日13时59分20秒
--=============================================================================--

特效_地面血迹  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 特效_地面血迹:初始化(坐标x,坐标y)

	self.标识类型 = "屏幕特效"
	self.血迹精灵  = D2D_精灵.创建(Q_游戏数据.图片组.地面血迹图片,0,0,41,42)	
	self.血迹精灵:置中心点(20,21)
	self.坐标 = {x=坐标x,y=坐标y}
	
	self.渐淡变量 = 100
	self.渐隐变量 = 235
	
	self.随机拉升 = 引擎:取随机小数(0.3,1.1)
	self.随机高度 = 引擎:取随机小数(0.1,0.3)
	
	self.排序参照点 = self.坐标.y
	
	self.已经消失 = false
	self.时钟变量 = 0
	
	self.临时t = 0
	self.烟灰 = false
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 特效_地面血迹:更新()

	self.时钟变量  = self.时钟变量  + dt 
	
	if (self.时钟变量  > 0.4) then

		self.渐淡变量 = self.渐淡变量 + 0.5
		self.渐隐变量 = self.渐隐变量 - 1
		
		if (self.临时t < 0.4) then 
			self.临时t = self.临时t + 0.005
			self.随机拉升 = self.随机拉升 + 0.002
			self.随机高度 = self.随机高度 + 0.002
			
		end 
	
		if (self.渐隐变量 < 30) then 
			self.已经消失 = true
			
			self.渐隐变量 = 0
			
		end 
		
		if (self.渐淡变量 > 200) then 
			self.渐淡变量 = 200
		end 
		
		if (self.烟灰 == false ) then 
			粒子特效(self.坐标.x,self.坐标.y,"死亡烟雾")
			self.烟灰 = true 
		end 
		
	end 
	
	



end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 特效_地面血迹:显示()
	
	self.血迹精灵:置颜色(ARGB(self.渐隐变量,self.渐淡变量,0,0))
	self.血迹精灵:显示_高级(self.坐标.x+ Q_游戏数据.画面偏移.x,self.坐标.y+ Q_游戏数据.画面偏移.y,0,self.随机拉升,self.随机高度)


end



--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 特效_地面血迹:销毁()


	
	self.血迹精灵:销毁()


end


