--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年4月26日12时53分9秒
--=============================================================================--

类_信息显示框  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_信息显示框:初始化(显示行数,单行字数,显示位置x,显示位置y)

	self.背景图片 = 引擎:载入图片("Dat/ui/信息框背景.png")
	self.背景精灵 = D2D_精灵.创建(self.背景图片,0,0,317,123)
	self.坐标 = {x=显示位置x,y=显示位置y}
      self.每行字数 = 单行字数
      self.每次显示行数 = 显示行数
      self.按行分割 = {}
      self.所有行数 = 0

	
	self.焦点 = false
      self.文字背景精灵 = D2D_精灵.创建(0, 0, 0, 50, 15)

	self.单字宽度 = 文字:取宽度("哈")
      self.t = 0
      self.文字精灵数据 = {}
	self.聊天显示框数据组 = {}
	self.最大保留行 = 50


      self.GUI布局 = D2D_GUI布局.创建()
      self.滑动条图片 = 引擎:载入图片 ("Dat/ui/信息框_滑块.png")

	self.信息框_上按钮图片 = 引擎:载入图片("Dat/ui/信息框_上按钮.png") 
	self.信息框_下按钮图片 = 引擎:载入图片("Dat/ui/信息框_下按钮.png") 



	self.滑动条 = D2D_滑动条.创建 (1, self.坐标.x+3,self.坐标.y+28,  12, 67, self.滑动条图片,0, 0, 11, 18, true)
      self.滑动条:置属性(0, 100, 2)
      self.滑动条:置位置(100)
	
	
	self.上按钮 = D2D_按钮.创建(2,self.坐标.x+3,self.坐标.y+6,11,13,self.信息框_上按钮图片,0,0)
	self.下按钮 = D2D_按钮.创建(3,self.坐标.x+3,self.坐标.y+104,11,13,self.信息框_下按钮图片,0,0)
	
      self.GUI布局:绑定控件(self.滑动条:取自身())
	self.GUI布局:绑定控件(self.上按钮:取自身())
	self.GUI布局:绑定控件(self.下按钮:取自身())
	
	
	
	self.已经格式化组 = {}
	
	
	self.显示框渲染区 = 引擎:创建渲染区(317,123,true)
	self.显示框渲染精灵 = D2D_精灵.创建(引擎:取渲染区纹理(self.显示框渲染区),0,0,317,123)
	
	
--	self.表情数据组 = {}
--	self.动画表情素材组 = {}
--	self.动画表情组 = {}
--	
--	for n=1,9 do
--		self.动画表情素材组[n] = 引擎:载入图片("Dat/chatico/" .. n .. ".png")
--	end
--	
--	
--	self.动画表情组[1] = D2D_动画.创建(self.动画表情素材组[1],4,8,0,0,17,17)
--	self.动画表情组[2] = D2D_动画.创建(self.动画表情素材组[2],4,6,0,0,17,17)
--	self.动画表情组[3] = D2D_动画.创建(self.动画表情素材组[3],7,4,0,0,17,17)
--	self.动画表情组[4] = D2D_动画.创建(self.动画表情素材组[4],2,8,0,0,17,17)
--	self.动画表情组[5] = D2D_动画.创建(self.动画表情素材组[5],4,6,0,0,17,17)
--	self.动画表情组[6] = D2D_动画.创建(self.动画表情素材组[6],4,8,0,0,17,17)
--	self.动画表情组[7] = D2D_动画.创建(self.动画表情素材组[7],7,8,0,0,17,17)
--	self.动画表情组[8] = D2D_动画.创建(self.动画表情素材组[8],5,4,0,0,17,17)
--	self.动画表情组[9] = D2D_动画.创建(self.动画表情素材组[9],5,6,0,0,17,19)
--	

--	
--	for n=1,#self.动画表情组 do
--		self.动画表情组[n]:置中心点(6,5)
--		self.动画表情组[n]:播放()
--	end
	
	
	
	

end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_信息显示框:更新()

	
	
	self.焦点 = false
	self.GUI布局:更新(dt)
	
--	for n=1,#self.动画表情组 do
--		self.动画表情组[n]:更新(dt)
--	end
    
		
	if (Q_游戏数据.鼠标坐标.x < 315 and Q_游戏数据.鼠标坐标.y > 50 and Q_游戏数据.鼠标坐标.y < 170) then 
		
		self.焦点 = true
		
		if ( table.getn(self.聊天显示框数据组) > self.每次显示行数 ) then 
			if (引擎:取滚轮事件 () > 0) then
				self:滚动(true)
			end
			if (引擎:取滚轮事件 () < 0) then
				self:滚动(false)
			end
		end 
		
		if (引擎:取按键事件(键_鼠标左)) then
			self:滑动条文字区域更新()
		end 
		
		
		if (引擎:取按键按下(键_鼠标左)) then
			if (self.上按钮:取状态()) then
				self:滚动(true)
			elseif (self.下按钮:取状态()) then
				self:滚动()
			end
			
			
		end
		
		
		
		
		
	end 
	
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_信息显示框:显示()
	
	
	if (self.焦点) then
		self.背景精灵:显示(self.坐标.x,self.坐标.y)
	end
	
	self.显示框渲染精灵:显示(self.坐标.x,self.坐标.y)
	
	if (self.焦点) then
		self.GUI布局:显示 ()
	end
	
	--self.左侧包围框:显示()
	
	
	if (Q_调试) then
		self.显示框渲染精灵:取包围盒():显示()
	end







end




---=============================================================================--
-- ■ 更新渲染()
--=============================================================================--

function 类_信息显示框:更新渲染()

	
	渲染开始(self.显示框渲染区)
	清屏()
	
	
	for n=1, table.getn(self.文字精灵数据) do
		self.文字背景精灵:置显示区域	 (0, 0, self.文字精灵数据 [n].宽 + 2, self.文字精灵数据 [n].高)
		self.文字背景精灵:置颜色 (self.文字精灵数据 [n].背景色)
		self.文字背景精灵:显示 (18,  5 + n * 16 - 14 )
		 


--		if (self.文字精灵数据 [n].开头) then 
--			
--			if (self.文字精灵数据 [n].类型 == 1) then 
--				self.系统精灵:显示(0,3 + n * 18 - 16)
--			elseif (self.文字精灵数据 [n].类型 == 2) then 
--				self.公告精灵:显示(0 ,3 + n * 18 - 16)
--			elseif (self.文字精灵数据 [n].类型 == 3) then 
--				self.提示精灵:显示(0 ,3 + n * 18 - 16)
--			elseif (self.文字精灵数据 [n].类型 == 0) then 
--				self.交流精灵:显示(0 ,3 + n * 18 - 16)
--				
--			end 
--			
--		end 


		文字:显示_描边(18, 7 + n * 16 - 14, self.文字精灵数据 [n].内容 ,self.文字精灵数据 [n].颜色,-16777216)
	


	end

	渲染结束()
	
	
end






---=============================================================================--
-- ■ 滑动条文字区域更新()
--=============================================================================--

function 类_信息显示框:滑动条文字区域更新()
	self.文字精灵数据 = {}
--	self.表情数据组 = {}

    self.t = 取整(self.滑动条:取位置 () / (100 / (self.所有行数 - self.每次显示行数))) + 1

    if (self.t == 0 )then
       self.t = 1
    end

	
	if (table.getn(self.聊天显示框数据组) >0 ) then 

	   if( table.getn(self.聊天显示框数据组) <self.每次显示行数) then
			self:更新指定行文本 (1, table.getn(self.聊天显示框数据组))
	   else
			self:更新指定行文本 (self.t, self.每次显示行数 - 1 + self.t)
	   end
	   
	end 
	
	
	self:更新渲染()
end 


---=============================================================================--
-- ■ 上滚动()
--=============================================================================--

function 类_信息显示框:滚动(方向)
	
	if (#self.聊天显示框数据组 <= self.每次显示行数) then
		return
	end
	
	
	if (方向) then 
		self.滑动条:置位置 (self.滑动条:取位置 () - 100 / (self.所有行数 - self.每次显示行数))
		self:滑动条文字区域更新()
	else
		self.滑动条:置位置 (self.滑动条:取位置 () + 100 / (self.所有行数 - self.每次显示行数))
		self:滑动条文字区域更新()
	end 
	
end








---=============================================================================--
-- ■ 更新聊天数据()
--=============================================================================--

function 类_信息显示框:更新聊天数据()

     self.滑动条:置位置 (100)

     local 按空格分割 ={}
     local 总数量 = table.getn(self.聊天显示框数据组)


	 if( 总数量 > self.最大保留行 ) then          -- 聊天数据总条数 >50
	
	    for n=1 , 总数量 - self.最大保留行 do
	
		table.remove(self.聊天显示框数据组,1)
	
	    end
	
	 end
	

	for n=1, table.getn(self.聊天显示框数据组) do
		
		if (self.聊天显示框数据组[n].已经格式化 == false) then
			
		--	self.聊天显示框数据组[n].内容 = self:表情扩展(self.聊天显示框数据组[n].内容)
			按空格分割 = 分割文本 (按行格式化文本 (self.聊天显示框数据组[n].内容, 文字,self.每行字数), "\n")
			
--			for k=1,#按空格分割 do
--				
--				if(k<#按空格分割 and string.sub(按空格分割 [k], -1) == "#") then  -- 最后一个是# 就把表情移到下一行
--					按空格分割 [k] = string.sub(按空格分割 [k], 0,-2)
--					按空格分割 [k+1] = "#" .. 按空格分割 [k+1]
--					
--				end
--			
--			end
			if (#按空格分割 == 1) then
				
				--self:格式化表情(self.聊天显示框数据组[n])
				
				self.聊天显示框数据组[n].已经格式化 = true
			elseif (table.getn(按空格分割) >1 ) then
				self.聊天显示框数据组[n].内容 = 按空格分割 [1]
				self.聊天显示框数据组[n].已经格式化 = true
				
			--	self:格式化表情(self.聊天显示框数据组[n])
				
				for i=2,#按空格分割 do
					local _当前信息数据 ={} 
					
					_当前信息数据.开头 = false
					_当前信息数据.内容 = 按空格分割 [i]
					
					_当前信息数据.颜色 = self.聊天显示框数据组 [n].颜色
					_当前信息数据.背景色 = self.聊天显示框数据组 [n].背景色
					_当前信息数据.类型 = self.聊天显示框数据组 [n].类型
					_当前信息数据.已经格式化 = true
					
					--self:格式化表情(_当前信息数据)
					--_当前信息数据.表情数据组 = self.聊天显示框数据组 [n].表情数据组
	
					
					
					table.insert(self.聊天显示框数据组,n+i-1 ,_当前信息数据)
				end
	
		     end
			     
		end

	end 


	self.按行分割 = {}
		
		
	for n=1, table.getn(self.聊天显示框数据组) do
		table.insert(self.按行分割,self.聊天显示框数据组 [n].内容 )
	end


	self.所有行数 = table.getn(self.按行分割) 

	self.t = 取整(self.滑动条:取位置 () / (100 / (self.所有行数 - self.每次显示行数))) + 1




	self:滑动条文字区域更新()
	


end



---=============================================================================--
-- ■ 更新指定行文本()
--=============================================================================--

function 类_信息显示框:更新指定行文本(首行,尾行)

	local _临时数据 = {}


      for n=首行,尾行 do

			_临时数据 =
			{
				宽  = 文字:取宽度 (self.聊天显示框数据组 [n].内容) ,
				高 = 文字:取高度 ( self.聊天显示框数据组 [n].内容) + 3 ,
				内容 =  self.聊天显示框数据组 [n].内容    ,
				颜色 = self.聊天显示框数据组 [n].颜色   ,
				背景色 = self.聊天显示框数据组 [n].背景色,
				类型 =  self.聊天显示框数据组 [n].类型,
				开头 =  self.聊天显示框数据组 [n].开头,
				表情数据组 =  self.聊天显示框数据组 [n].表情数据组
			}



--self.表情数据组 

		table.insert(self.文字精灵数据,_临时数据)

       end

	

end




---=============================================================================--
-- ■ 销毁()
--=============================================================================--

function 类_信息显示框:销毁()
	
	引擎:销毁图片(self.滑动条图片)
      self.文字背景精灵:销毁()
	
	引擎:销毁图片(self.背景框上边栏图片)
	引擎:销毁图片(self.背景框下边栏图片)
	引擎:销毁图片(self.背景框上边栏点燃图片)
	引擎:销毁图片(self.背景框上边栏默认图片)

	self.背景框上边栏精灵:销毁()
	self.背景框下边栏精灵:销毁()
	self.背景框上边栏点燃精灵:销毁()
	self.背景框上边栏默认精灵:销毁()
	
	引擎:销毁图片(self.系统信息框_背景图片)
	self.系统信息框_背景精灵:销毁()

	
	
	
	
end 


---=============================================================================--
-- ■ 表情扩展()
--=============================================================================--

function 类_信息显示框:表情扩展(待扩展字符串)


	local 内容=分割为字符组(待扩展字符串)
	local b= table.getn(内容)

	local a=0
	
	for j=#内容, 1,-1 do
		
		if(内容[j]=="#") then
			
			if(j>1) then
				local 数值=tonumber(内容[j+1])
				if( 数值~=nil and 数值>0 and 数值<=9) then --1,9
					table.insert(内容,j+2," ")
				end
			
			end
		
		end
		
	end
	
	local 最终文本 =table.concat(内容)

	
	return 最终文本


end



---=============================================================================--
-- ■ 格式化表情()
--=============================================================================--

function 类_信息显示框:格式化表情(_临时数据)
	
	_临时数据.表情数据组 ={}

		local 内容=分割为字符组(_临时数据.内容)
		local b= table.getn(内容)
		local 当前位置 = ""

		for j=1, b do
			当前位置 = 当前位置 .. 内容[j]
			
			if(内容[j]=="#") then
				
				if(j<b) then
						
					local 数值=tonumber(内容[j+1])
					if( 数值~=nil and 数值>0 and 数值<=9) then --1,9
						内容[j]=" "
						local 表情信息 = {id=数值,x=文字:取宽度(当前位置)}
						table.insert(_临时数据.表情数据组,表情信息)
					end
						
				end
			
			end
			
		end
		
		_临时数据.内容 = table.concat(内容)

end














