--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年5月3日15时30分33秒
--=============================================================================--

类_技能格子  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_技能格子:初始化(x坐标, y坐标,标识)
	
      self.标识 = 标识
      self.坐标 = {x=x坐标,y=y坐标}
	self.包围盒  = D2D_包围盒.创建(x坐标, y坐标,28,28)
	
	self.技能  = nil
	
	
	self.风格提示= {
			原始内容 = "" ,
			风格文字组 = {},
			宽度 = 0,
			高度 = 0
	}
	
	

	self.蠕动效果计次 = 0
	self.本次蠕动偏移 = 0.005

end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_技能格子:更新()



	
	if (引擎:取按键弹起(键_鼠标左)) then      -- 左键放置技能
		
		if (self.包围盒:检测_点(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)) then
			
			if (self.标识 <= 20) then -- 技能窗口内的格子
				
				if (self.技能 ~= nil and self.技能.等级 > 0) then  -- 自身有技能
					
					Q_游戏数据.鼠标技能.对象 = self.技能
					
				end
				
				
			else  -- 快捷格子
				
				
				if (Q_游戏数据.鼠标技能.对象 ~= nil) then -- 鼠标有技能
					
					
					if (self.技能 ~= nil) then  -- 自身有技能 交换
						
						self.技能,Q_游戏数据.鼠标技能.对象 =  Q_游戏数据.鼠标技能.对象 ,self.技能
						
						
					else
						self:置技能(Q_游戏数据.鼠标技能.对象)
						Q_游戏数据.鼠标技能.对象= nil
					end
					
					
				else
					
					
					if (self.技能 ~= nil and self.技能.等级 > 0) then  -- 自身有技能 鼠标拿起
						Q_游戏数据.鼠标技能.对象 = self.技能
						self.技能 = nil
					end
					
					
					
					
				end
				
--				
--				if (self.技能 ~=  nil) then  -- 自身有技能
--					
--					
--				else
--					

--					
--				end
				
				
				
			end
			
		
		end
		
		
	end
	
	
	
	
	


end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_技能格子:显示(是否显示附加信息)

	if(self.技能 ~= nil) then
		
		
--		self.技能.精灵:显示(self.坐标.x ,self.坐标.y)
		
		if ( self.技能.延时时间 ~= 0) then -- self.技能.类型 == "快捷" and
		
			self.技能.精灵:置颜色(颜色_灰)
			self.技能.精灵:置显示区域 (0 ,0, 28, 28)
			self.技能.精灵:显示(self.坐标.x ,self.坐标.y)
			
			self.技能.精灵:置颜色(ARGB(255,255,255,255))	
			self.技能.精灵:置显示区域 (0 ,0, 28, 28 - (self.技能.延时时间 - self.技能.延时时间参考) / self.技能.延时时间 * 28)
			
			
		else
			
			self.技能.精灵:置颜色(颜色_白)
			
			if (not self.技能.可用) then
				self.技能.精灵:置颜色(颜色_灰)
			end
			
			
		end
			
		
		self.技能.精灵:显示(self.坐标.x ,self.坐标.y)
		
		
		if (是否显示附加信息) then
			
			文字:显示_描边(self.坐标.x + 36 ,self.坐标.y,self.技能.名称,颜色_白,-15724528)
			
			
			if (self.技能.等级 > 3) then
				文字:显示_描边(self.坐标.x + 39 ,self.坐标.y + 17,"MAX",颜色_白,-15724528)
			else
				文字:显示_描边(self.坐标.x + 39 ,self.坐标.y + 17,string.format("%d/100",self.技能.熟练),颜色_白,-15724528)
			end
			
			
			if (self.技能.等级 > 0) then
				if (self.技能.等级 > 3) then
					文字:显示_描边(self.坐标.x + 39 ,self.坐标.y ,string.format("%29s","Lv.3"),颜色_白,-15724528)
					Q_游戏数据.精灵组.技能熟练条精灵:显示_高级(self.坐标.x+91 ,self.坐标.y+15,0,1,1)
					
					
				else
					文字:显示_描边(self.坐标.x + 39 ,self.坐标.y ,string.format("%29s","Lv." .. self.技能.等级),颜色_白,-15724528)
					if (self.技能.熟练 > 0 ) then
						self.蠕动效果计次 = self.蠕动效果计次 + dt
						if (self.蠕动效果计次 > 0.3) then
							self.本次蠕动偏移 = -self.本次蠕动偏移
							
							self.蠕动效果计次 = 0
						end
						
						Q_游戏数据.精灵组.技能熟练条精灵:显示_高级(self.坐标.x+91 ,self.坐标.y+15,0,self.技能.熟练/100 + self.本次蠕动偏移,1)
						
					end
					
				end
				

				
				Q_游戏数据.精灵组.技能熟练框精灵:显示(self.坐标.x + 87,self.坐标.y + 12)
				
			end
			
			
			--Q_游戏数据.精灵组.技能熟练条精灵:置显示区域()
			
			--self.技能.熟练
			
		end
		
		
		if (self.技能.特效显示)then
			self.技能.CD特效:显示(self.坐标.x-1 ,self.坐标.y)
		end
		
	end

	if (Q_调试) then
		
		self.包围盒:显示()
		文字:显示(self.坐标.x ,self.坐标.y , self.标识)
	end


end






--=============================================================================--
-- ■ 置技能()
--=============================================================================--

function 类_技能格子:置技能(技能对象)

      self.技能 = 技能对象
	
	
	if (self.技能 ~= nil) then 
	
		self.风格提示.原始内容 = 格式化技能属性(self.技能)
		self.风格提示.风格文字组, self.风格提示.宽度 , self.风格提示.高度 = 格式化文字 (文字,self.风格提示.原始内容,5) 

		
		
	end 

	
	


end





--=============================================================================--
-- ■ 置位置()
--=============================================================================--

function 类_技能格子:置位置(x坐标,y坐标)

      self.坐标.x =  x坐标
      self.坐标.y =  y坐标
      
      self.包围盒:置位置(self.坐标.x,self.坐标.y)

end



