--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:hjk5211  创建:2010年5月26日10时9分34秒
--=============================================================================--

地图物件  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 地图物件:初始化(物件信息,图片地址,id)
	
	self.标识类型 = "地图物件"
	self.物件精灵 = D2D_精灵.创建(图片地址,0 ,0 ,引擎:取图片宽度(图片地址),引擎:取图片高度(图片地址))
	self.物件精灵:置中心点(取整( 引擎:取图片宽度(图片地址)/2 ), 取整(引擎:取图片高度(图片地址)/2))
	
	
	self.翻转 = 物件信息.翻转
	
	self.坐标 = {x=物件信息.显示x, y=物件信息.显示y}
	
	self.中心点偏移 = {x=物件信息.中心点偏移_x,y=物件信息.中心点偏移_y}
	self.参照点 = {x=物件信息.中心点_x,y=物件信息.中心点_y}
	self.id = id


	self.参照点.x = self.坐标.x + self.中心点偏移.x 
	self.参照点.y = self.坐标.y + self.中心点偏移.y 

	if (物件信息.自动透明 == 1) then 
		self.是否透明动画 = true 
	else 
		self.是否透明动画 = false 
	end 
	
	self.当前透明度 = 255
	
	self.排序参照点 = self.坐标.y + self.中心点偏移.y
	
	
end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 地图物件:更新()
	
	self.排序参照点 = self.坐标.y + self.中心点偏移.y
	
	
	if (self.是否透明动画) then

	
		if (Q_主角.坐标.y  < self.排序参照点 and self.物件精灵:取包围盒 ():检测_点 (Q_主角.坐标.x+ Q_游戏数据.画面偏移.x, Q_主角.坐标.y )) then
				
				
			if (self.当前透明度 > 150) then
	
			    self.当前透明度 = self.当前透明度 - 10
				self.物件精灵:置颜色 (ARGB (self.当前透明度, 255, 255, 255))
	
			end
			
		else
			if (self.当前透明度 ~= 255) then
				self.当前透明度 = self.当前透明度 + 10
			end
			self.物件精灵:置颜色 (ARGB (self.当前透明度, 255, 255, 255))
		end
	
		
	end 



end



--=============================================================================--
-- ■ 显示
--=============================================================================--
function 地图物件:显示()
	self.参照点.x = self.坐标.x + self.中心点偏移.x 
	self.参照点.y = self.坐标.y + self.中心点偏移.y 
	
	
	if ( math.abs(Q_主角.坐标.x -  self.参照点.x  ) < Q_游戏数据.屏幕宽度 + 200 ) then
		self.物件精灵:显示_高级(self.坐标.x+ Q_游戏数据.画面偏移.x,self.坐标.y+ Q_游戏数据.画面偏移.y,0,self.翻转,1)
	end
	
	
	if (Q_调试) then 
		引擎:画圆(self.参照点.x+ Q_游戏数据.画面偏移.x ,self.参照点.y+ Q_游戏数据.画面偏移.y, 5,50,颜色_红)
		--self.物件精灵:取包围盒():显示()
	end 
	
	
end



--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 地图物件:销毁()
	
	self.物件精灵:销毁()
	
end




