--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2010年9月4日10时45分16秒
--=============================================================================--

鼠标类  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 鼠标类:初始化()

	self.普通图片 = 引擎:载入图片("Dat/ui/cur/普通.png")
	self.普通精灵= D2D_精灵.创建(self.普通图片,0,0,32,32)
	
	self.按下图片 = 引擎:载入图片("Dat/ui/cur/按下.png")
	self.按下精灵= D2D_精灵.创建(self.按下图片,0,0,31,31)
	
	self.出售图片 = 引擎:载入图片("Dat/ui/cur/出售.png")
	self.出售动画= D2D_动画.创建(self.出售图片,4,6,0,0,39,29)
	self.出售动画:播放()

	
	self.购买图片 = 引擎:载入图片("Dat/ui/cur/购买.png")
	self.购买动画 = D2D_动画.创建(self.购买图片,4,6,0,0,39,29)
	self.购买动画:播放()
	
	self.分解图片 = 引擎:载入图片("Dat/ui/cur/分解.png")
	self.分解动画 = D2D_动画.创建(self.分解图片,4,6,0,0,39,29)
	self.分解动画:播放()
	
	
	
	
	self.对话图片 = 引擎:载入图片("Dat/ui/cur/NPC对话.png")
	self.对话动画= D2D_动画.创建(self.对话图片,4,6,0,0,27,23)
	self.对话动画:播放()
	
	
	
	
	
	
	
	
	
	self.模式 = "普通"
	
	

end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 鼠标类:更新()

	
	if (self.模式 == "对话") then 
		self.对话动画:更新(dt)
	end 
	
	if (self.模式 == "购买") then 
		self.购买动画:更新(dt)
	end 
	
	if (self.模式 == "出售") then 
		self.出售动画:更新(dt)
	end 

	if (self.模式 == "分解") then 
		self.分解动画:更新(dt)
	end 
	

	
	if (引擎:取按键事件(键_鼠标左)) then 
		if (Q_游戏鼠标.模式 == "普通" ) then 
			self.模式 = "按下"
		end 
		
	end 







end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 鼠标类:显示()


	if (self.模式 == "普通") then 
		self.普通精灵:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	elseif (self.模式 == "按下") then 	
		self.按下精灵:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	elseif (self.模式 == "对话") then 	
		self.对话动画:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	elseif (self.模式 == "出售") then 	
		self.出售动画:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	elseif (self.模式 == "购买") then 	
		self.购买动画:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)
	elseif (self.模式 == "分解") then 	
		self.分解动画:显示(Q_游戏数据.鼠标坐标.x,Q_游戏数据.鼠标坐标.y)

	end 
	


end





