--==============================================================================--
--╭━━╮┏━━╮╭━━╮╭━━╮╭╭╮╮╭━━╮　╭╭╮╮╭━━╮╭╮╭╮╭━━╮
--┃╭━╯┃╭╮┃┃╭━╯┃╭╮┃┃　　┃┃╭━╯　┃　　┃┃╭╮┃┃╰╯┃┃╭━╯
--┃╰━╮┃┃┃┃┃┃╭╮┃╰╯┃┃┃┃┃┃╰━╮　┃┃┃┃┃╰╯┃┃　╭╯┃╰━╮
--┃╭━╯┃┃┃┃┃┃┃┃┃╭╮┃┃╭╮┃┃╭━╯　┃╭╮┃┃╭╮┃┃　╰╮┃╭━╯
--┃╰━╮┃╰╯┃┃╰╯┃┃┃┃┃┃┃┃┃┃╰━╮　┃┃┃┃┃┃┃┃┃╭╮┃┃╰━╮
--╰━━╯┗━━╯╰━━╯╰╯╰╯╰╯╰╯╰━━╯  ╰╯╰╯╰╯╰╯╰╯╰╯╰━━╯
--
-- 作者:  创建:2011年4月18日15时46分54秒
--=============================================================================--

类_屏幕血条进度类  = class()



--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 类_屏幕血条进度类:初始化()

	self.背景图片 = 引擎:载入图片("Dat/ui/背景.png")
	self.前景图片 = 引擎:载入图片("Dat/ui/前景.png")
	self.尾部图片 = 引擎:载入图片("Dat/ui/尾部.png")
	
	
	self.背景精灵 = D2D_精灵.创建(self.背景图片,0,0,597,30)
	self.前景精灵 = D2D_精灵.创建(self.前景图片,0,0,597,9)
	self.尾部精灵 = D2D_精灵.创建(self.尾部图片,0,0,4,15)
	
	
	
	self.头像精灵 = D2D_精灵.创建(0,0,1,1)
	self.显示名称 = ""
	self.本次对象 = nil
	
	self.坐标 = {x=10,y=15}
	
	self.闪光精灵 = D2D_精灵.创建(0,0,100,9)
	self.闪光属性 = {
			x = 0,
			计次 = 0,
			透明度 = 255,
			长度 = 0
	
	}
	
	
	self.长度 = 300
	self.hp = 300
	self.maxhp = 300
	
	
	self.可视 = false
	self.显示时间 = 0


end





--=============================================================================--
-- ■ 更新
--=============================================================================--
function 类_屏幕血条进度类:更新()
	
	
	if (self.可视) then
	
		if (self.闪光属性.透明度 > 80) then
			self.闪光属性.透明度 = self.闪光属性.透明度 - 10
		else
			
			if (self.闪光属性.长度>0) then
				self.闪光属性.长度 = self.闪光属性.长度 - 5
			else
				self.闪光属性.长度 = 0
			end
			
			
		end
		
		
		if (self.本次对象 ~= nil and self.本次对象.已经死亡) then
			self.可视 = false
		end
		
		
	end
	
	
	

end





--=============================================================================--
-- ■ 显示
--=============================================================================--
function 类_屏幕血条进度类:显示()

	if (self.可视) then
		self.背景精灵:置显示区域(0,0,self.长度+30,30)
		self.背景精灵:显示(self.坐标.x,self.坐标.y)
		self.尾部精灵:显示(self.坐标.x+self.长度+29,self.坐标.y+15)
		
		self.头像精灵:显示(self.坐标.x+2,self.坐标.y+2)
		
		
		文字_描边显示(文字,self.坐标.x+35,self.坐标.y+2,self.显示名称,-1652581 ,-16777216)--颜色_黄
		
		--self.显示名称
		
		local 本次宽度 = (self.hp/self.maxhp)*self.长度
		
		if (本次宽度 <=0) then
			本次宽度 = 0
		end
		
		self.前景精灵:置显示区域(0,0,本次宽度,9)
		self.前景精灵:显示(self.坐标.x+30,self.坐标.y+18)
		
		
		self.闪光精灵:置显示区域(0,0,self.闪光属性.长度,9)
		self.闪光精灵:置颜色(ARGB(self.闪光属性.透明度,255,255,255))
		self.闪光精灵:显示(self.坐标.x+self.闪光属性.x+30,self.坐标.y+18)
		
	end

	

end




--=============================================================================--
-- ■ 置属性
--=============================================================================--
function 类_屏幕血条进度类:置属性(对象,长度,当前hp,当前maxhp,本次掉血)


	if (当前hp <=0) then 
		return 
	end
	
	local 掉血前hp = 当前hp
	
	self.本次对象 = 对象
	
	self.头像精灵 = self.本次对象.对象.头像精灵
	self.显示名称 = self.本次对象.对象.名称
	
	
	self.hp = 当前hp - 本次掉血
	self.maxhp = 当前maxhp
	self.长度  = 长度
	
	
	self.闪光属性.长度 = (本次掉血/self.maxhp)*self.长度 
	self.闪光属性.透明度 = 255
	self.闪光属性.x = (self.hp/self.maxhp)*self.长度

	
	if (掉血前hp < 本次掉血) then
		self.闪光属性.长度 = (掉血前hp/self.maxhp)*self.长度 
		self.闪光属性.透明度 = 255
		self.闪光属性.x = 0
	end
	
	self.可视 = true



end






















